RajeshreeRinku/LPC400-header-file/lpc4088.h
 __IO uint32_t PLLCON1;
 __IO uint32_t PLLCFG1;
 __I uint32_t PLLSTAT1;
 __O uint32_t PLLFEED1;
 __IO uint8_t RESRVED1[0x13];
	
	__IO uint32_t PCON;
	__IO uint32_t PCONP;
	__IO uint32_t PCONP1;
	__IO uint8_t RESRVED2[0x37];
	__IO uint32_t EMCCLKSEL;                 /*External Memory Controller Clock Selection register*/
	__IO uint32_t CCLKSEL;                   /*CPU Clock Selection register*/
	__IO uint32_t USBCLKSEL;                 /*USB Clock Selection register*/
	__IO uint32_t CLKSRCSEL;                 /*Clock Source Select Register*/
	__IO uint32_t CANSLEEPCLR;               /*Allows clearing the current CAN channel sleep state as well as reading back that state*/
  __IO uint32_t CANWAKEFLAGS;              /*Indicates the wake-up state of the CAN channels.*/
	__IO uint8_t RESERVED5[0x28];
	__IO uint32_t EXTINT;                    /*External Interrupt Flag Register*/
	__IO uint32_t RESERVED6;
	__IO uint32_t EXTMODE;                   /*External Interrupt Mode register*/
	__IO uint32_t EXTPOLAR;                  /*External Interrupt Polarity Register*/
	__IO uint8_t RESERVED7[0x30];
	__IO uint32_t RSID;                      /*Reset Source Identification Register*/
	__IO uint8_t RESERVED8[0x1C];
	__IO uint32_t SCS;                       /*System Control and Status*/
	__IO uint8_t RESREVED9[4];
	__IO uint32_t PCLKSEL;                   /*Peripheral Clock Selection register*/
	__IO uint8_t RESERVED10[4];
	__IO uint32_t PBOOST;                    /*Power boost register*/
	__IO uint32_t SPIFICLKSEL;               /*SPIFI Clock Selection register*/
	__IO uint32_t LCD_CFG;                   /*LCD Clock configuration register*/
	__IO uint8_t RESERVED11[4];
	__IO uint32_t USBINTST;                  /*USB Interrupt Status*/
	__IO uint32_t DMACREQSEL;                /*Selects between alternative requests on DMA channels 0 through 7 and 10 through 15.*/
  __IO uint32_t CLKOUTCFG;                 /*Clock Output Configuration register*/
	__IO uint32_t RESERVED12;
	__IO uint32_t RSTCON0;                   /*Individual peripheral reset control bits*/
	__IO uint32_t RESERVED13;
	__IO uint32_t RSTCON1;                   /*Individual peripheral reset control bits*/
	__IO uint8_t RESERVED14[0x8];
	__IO uint32_t EMCDLYCTL;                 /*Values for the 4 programmable delays associated with SDRAM operation.*/
  __IO uint32_t RESRVED15;
	__IO uint32_t EMCCAL;                    /*Controls the calibration counter for programmable delays and returns the result value.*/

}SYSTEM_CONTROL_TYPEDEF;

typedef struct
{
__IO uint32_t FLASHCFG;
}FLASH_CONTROL_TYPEDEF;

typedef struct
{
__IO uint32_t ISER0;                      /*Interrupt Set-Enable Registers. These registers allow enabling*/
__IO uint32_t ISER1;                      /*interrupts and reading back the interrupt enables for specific peripheral functions*/

}INTERRUPT_SET_ENABLE_TYPEDEF;

typedef struct
{
	__IO uint32_t ICER0;                    /*Interrupt Clear-Enable Registers. These registers allow Interrupt Clear-Enable Registers. These registers allow
                                            disabling interrupts and reading back the interrupt enables for specific peripheral functions.*/
	__IO uint32_t ICER1;
}INTERRUPT_CLEAR_ENABLE_TYPEDEF;

typedef struct
{
 __IO uint32_t ISPR0;                    /*Interrupt Set-Pending Registers. These registers allow changing the interrupt state to pending and reading back the
                                           interrupt pending state for specific peripheral functions.*/
 __IO uint32_t ISPR1;
}INTERRUPT_SET_PENDING_TYPEDEF;

typedef struct
{
 __IO uint32_t ICPR0;                   /*Interrupt Clear-Pending Registers. These registers allow changing the interrupt state to not pending and reading back
                                          the interrupt pending state for specific peripheral functions.*/
 __IO uint32_t ICPR1;
}INTERRUPT_CLEAR_PENDING_TYPEDEF;

typedef struct
{
 __I uint32_t IABR0;                   /*Interrupt Active Bit Registers. These registers allow reading the current interrupt active state for specific peripheral functions.*/
 __I uint32_t IABR1;
}INTERRUPT_ACTIVE_BIT_TYPEDEF;

typedef struct
{
  __IO uint32_t IPR0;
	__IO uint32_t IPR1;
	__IO uint32_t IPR2;
	__IO uint32_t IPR3;
	__IO uint32_t IPR4;
	__IO uint32_t IPR5;
	__IO uint32_t IPR6;
	__IO uint32_t IPR7;
	__IO uint32_t IPR8;
	__IO uint32_t IPR9;
	__IO uint32_t IPR10;
}INTERRUPT_POLARITY_TYPEDEF;

typedef struct
{
 __O uint32_t STIR;                   /*Software Trigger Interrupt Register. This register allows software to generate an interrupt.*/
}SOFTWARE_TRIGGER_INTERRUPT_TYPEDEF;

typedef struct
{
  __IO uint32_t IOCON_P0_00;
  __IO uint32_t IOCON_P0_01;
	__IO uint32_t IOCON_P0_02;
	__IO uint32_t IOCON_P0_03;
	__IO uint32_t IOCON_P0_04;
	__IO uint32_t IOCON_P0_05;
	__IO uint32_t IOCON_P0_06;
	__IO uint32_t IOCON_P0_07;
	__IO uint32_t IOCON_P0_08;
	__IO uint32_t IOCON_P0_09;
	__IO uint32_t IOCON_P0_10;
	__IO uint32_t IOCON_P0_11;
	__IO uint32_t IOCON_P0_12;
	__IO uint32_t IOCON_P0_13;
	__IO uint32_t IOCON_P0_14;
	__IO uint32_t IOCON_P0_15;
	__IO uint32_t IOCON_P0_16;
	__IO uint32_t IOCON_P0_17;
	__IO uint32_t IOCON_P0_18;
	__IO uint32_t IOCON_P0_19;
	__IO uint32_t IOCON_P0_20;
	__IO uint32_t IOCON_P0_21;
	__IO uint32_t IOCON_P0_22;
	__IO uint32_t IOCON_P0_23;
	__IO uint32_t IOCON_P0_24;
	__IO uint32_t IOCON_P0_25;
	__IO uint32_t IOCON_P0_26;
	__IO uint32_t IOCON_P0_27;
	__IO uint32_t IOCON_P0_28;
	__IO uint32_t IOCON_P0_29;
	__IO uint32_t IOCON_P0_30;
	__IO uint32_t IOCON_P0_31;
	
	__IO uint32_t IOCON_P1_00;
  __IO uint32_t IOCON_P1_01;
	__IO uint32_t IOCON_P1_02;
	__IO uint32_t IOCON_P1_03;
	__IO uint32_t IOCON_P1_04;
	__IO uint32_t IOCON_P1_05;
	__IO uint32_t IOCON_P1_06;
	__IO uint32_t IOCON_P1_07;
	__IO uint32_t IOCON_P1_08;
	__IO uint32_t IOCON_P1_09;
	__IO uint32_t IOCON_P1_10;
	__IO uint32_t IOCON_P1_11;
	__IO uint32_t IOCON_P1_12;
	__IO uint32_t IOCON_P1_13;
	__IO uint32_t IOCON_P1_14;
	__IO uint32_t IOCON_P1_15;
	__IO uint32_t IOCON_P1_16;
	__IO uint32_t IOCON_P1_17;
	__IO uint32_t IOCON_P1_18;
	__IO uint32_t IOCON_P1_19;
	__IO uint32_t IOCON_P1_20;
	__IO uint32_t IOCON_P1_21;
	__IO uint32_t IOCON_P1_22;
	__IO uint32_t IOCON_P1_23;
	__IO uint32_t IOCON_P1_24;
	__IO uint32_t IOCON_P1_25;
	__IO uint32_t IOCON_P1_26;
	__IO uint32_t IOCON_P1_27;
	__IO uint32_t IOCON_P1_28;
	__IO uint32_t IOCON_P1_29;
	__IO uint32_t IOCON_P1_30;
	__IO uint32_t IOCON_P1_31;
	
