RajeshreeRinku/LPC400-header-file/lpc4088.h
	__IO uint32_t IOCON_P2_00;
  __IO uint32_t IOCON_P2_01;
	__IO uint32_t IOCON_P2_02;
	__IO uint32_t IOCON_P2_03;
	__IO uint32_t IOCON_P2_04;
	__IO uint32_t IOCON_P2_05;
	__IO uint32_t IOCON_P2_06;
	__IO uint32_t IOCON_P2_07;
	__IO uint32_t IOCON_P2_08;
	__IO uint32_t IOCON_P2_09;
	__IO uint32_t IOCON_P2_10;
	__IO uint32_t IOCON_P2_11;
	__IO uint32_t IOCON_P2_12;
	__IO uint32_t IOCON_P2_13;
	__IO uint32_t IOCON_P2_14;
	__IO uint32_t IOCON_P2_15;
	__IO uint32_t IOCON_P2_16;
	__IO uint32_t IOCON_P2_17;
	__IO uint32_t IOCON_P2_18;
	__IO uint32_t IOCON_P2_19;
	__IO uint32_t IOCON_P2_20;
	__IO uint32_t IOCON_P2_21;
	__IO uint32_t IOCON_P2_22;
	__IO uint32_t IOCON_P2_23;
	__IO uint32_t IOCON_P2_24;
	__IO uint32_t IOCON_P2_25;
	__IO uint32_t IOCON_P2_26;
	__IO uint32_t IOCON_P2_27;
	__IO uint32_t IOCON_P2_28;
	__IO uint32_t IOCON_P2_29;
	__IO uint32_t IOCON_P2_30;
	__IO uint32_t IOCON_P2_31;
	
	__IO uint32_t IOCON_P3_00;
  __IO uint32_t IOCON_P3_01;
	__IO uint32_t IOCON_P3_02;
	__IO uint32_t IOCON_P3_03;
	__IO uint32_t IOCON_P3_04;
	__IO uint32_t IOCON_P3_05;
	__IO uint32_t IOCON_P3_06;
	__IO uint32_t IOCON_P3_07;
	__IO uint32_t IOCON_P3_08;
	__IO uint32_t IOCON_P3_09;
	__IO uint32_t IOCON_P3_10;
	__IO uint32_t IOCON_P3_11;
	__IO uint32_t IOCON_P3_12;
	__IO uint32_t IOCON_P3_13;
	__IO uint32_t IOCON_P3_14;
	__IO uint32_t IOCON_P3_15;
	__IO uint32_t IOCON_P3_16;
	__IO uint32_t IOCON_P3_17;
	__IO uint32_t IOCON_P3_18;
	__IO uint32_t IOCON_P3_19;
	__IO uint32_t IOCON_P3_20;
	__IO uint32_t IOCON_P3_21;
	__IO uint32_t IOCON_P3_22;
	__IO uint32_t IOCON_P3_23;
	__IO uint32_t IOCON_P3_24;
	__IO uint32_t IOCON_P3_25;
	__IO uint32_t IOCON_P3_26;
	__IO uint32_t IOCON_P3_27;
	__IO uint32_t IOCON_P3_28;
	__IO uint32_t IOCON_P3_29;
	__IO uint32_t IOCON_P3_30;
	__IO uint32_t IOCON_P3_31;
	
	__IO uint32_t IOCON_P4_00;
  __IO uint32_t IOCON_P4_01;
	__IO uint32_t IOCON_P4_02;
	__IO uint32_t IOCON_P4_03;
	__IO uint32_t IOCON_P4_04;
	__IO uint32_t IOCON_P4_05;
	__IO uint32_t IOCON_P4_06;
	__IO uint32_t IOCON_P4_07;
	__IO uint32_t IOCON_P4_08;
	__IO uint32_t IOCON_P4_09;
	__IO uint32_t IOCON_P4_10;
	__IO uint32_t IOCON_P4_11;
	__IO uint32_t IOCON_P4_12;
	__IO uint32_t IOCON_P4_13;
	__IO uint32_t IOCON_P4_14;
	__IO uint32_t IOCON_P4_15;
	__IO uint32_t IOCON_P4_16;
	__IO uint32_t IOCON_P4_17;
	__IO uint32_t IOCON_P4_18;
	__IO uint32_t IOCON_P4_19;
	__IO uint32_t IOCON_P4_20;
	__IO uint32_t IOCON_P4_21;
	__IO uint32_t IOCON_P4_22;
	__IO uint32_t IOCON_P4_23;
	__IO uint32_t IOCON_P4_24;
	__IO uint32_t IOCON_P4_25;
	__IO uint32_t IOCON_P4_26;
	__IO uint32_t IOCON_P4_27;
	__IO uint32_t IOCON_P4_28;
	__IO uint32_t IOCON_P4_29;
	__IO uint32_t IOCON_P4_30;
	__IO uint32_t IOCON_P4_31;
	
	__IO uint32_t IOCON_P5_00;
  __IO uint32_t IOCON_P5_01;
	__IO uint32_t IOCON_P5_02;
	__IO uint32_t IOCON_P5_03;
	__IO uint32_t IOCON_P5_04;
}IOCON_TYPEDEF;

typedef struct
{
 __IO uint32_t DIR0;                /*GPIO Port0 Direction control register.*/
 __IO uint8_t RESERVED0[0xC];
 __IO uint32_t MASK0;               /*Mask register for Port0.*/
 __IO uint32_t PIN0;                /*Port0 Pin value register using FIOMASK.*/
 __IO uint32_t SET0;                /*Port0 Output Set register using FIOMASK.*/
 __O uint32_t CLR0;                 /*Port0 Output Clear register using FIOMASK.*/
	
 __IO uint32_t DIR1;                /*GPIO Port1 Direction control register.*/
 __IO uint8_t RESERVED1[0xC];
 __IO uint32_t MASK1;               /*Mask register for Port1.*/
 __IO uint32_t PIN1;                /*Port1 Pin value register using FIOMASK.*/
 __IO uint32_t SET1;                /*Port1 Output Set register using FIOMASK.*/
 __O uint32_t CLR1;                 /*Port1 Output Clear register using FIOMASK.*/
	
 __IO uint32_t DIR2;                /*GPIO Port2 Direction control register.*/
 __IO uint8_t RESERVED2[0xC];
 __IO uint32_t MASK2;               /*Mask register for Port2.*/
 __IO uint32_t PIN2;                /*Port2 Pin value register using FIOMASK.*/
 __IO uint32_t SET2;                /*Port2 Output Set register using FIOMASK.*/
 __O uint32_t CLR2;                 /*Port2 Output Clear register using FIOMASK.*/
	
 __IO uint32_t DIR3;                /*GPIO Port3 Direction control register.*/
 __IO uint8_t RESERVED3[0xC];
 __IO uint32_t MASK3;               /*Mask register for Port3.*/
 __IO uint32_t PIN3;                /*Port3 Pin value register using FIOMASK.*/
 __IO uint32_t SET3;                /*Port3 Output Set register using FIOMASK.*/
 __O uint32_t CLR3;                 /*Port3 Output Clear register using FIOMASK.*/
 
 __IO uint32_t DIR4;                /*GPIO Port4 Direction control register.*/
 __IO uint8_t RESERVED4[0xC];
 __IO uint32_t MASK4;               /*Mask register for Port4.*/
 __IO uint32_t PIN4;                /*Port4 Pin value register using FIOMASK.*/
 __IO uint32_t SET4;                /*Port4 Output Set register using FIOMASK.*/
 __O uint32_t CLR4;                 /*Port4 Output Clear register using FIOMASK.*/
 
 __IO uint32_t DIR5;                /*GPIO Port5 Direction control register.*/
 __IO uint8_t RESERVED5[0xC];
 __IO uint32_t MASK5;               /*Mask register for Port5.*/
 __IO uint32_t PIN5;                /*Port5 Pin value register using FIOMASK.*/
 __IO uint32_t SET5;                /*Port5 Output Set register using FIOMASK.*/
 __O uint32_t CLR5;                 /*Port5 Output Clear register using FIOMASK.*/
 
}GPIO_TYPEDEF;

typedef struct
{
 __I uint32_t STATUS;               /*GPIO overall Interrupt Status*/
 __I uint32_t STATR0;               /*GPIO Interrupt Status for Rising edge for Port 0.*/
 __I uint32_t STATF0;               /*GPIO Interrupt Status for Falling edge for Port 0.*/
 __O uint32_t CLR0;                 /*GPIO Interrupt Clear*/
 __IO uint32_t ENR0;                /*GPIO Interrupt Enable for Rising edge for Port 0.*/
 __IO uint32_t ENF0;                /*GPIO Interrupt Enable for Falling edge for Port 0.*/
 __IO uint8_t RESERVED0[0xC];
 __I uint32_t STATR2;               /*GPIO Interrupt Status for Rising edge for Port 0.*/
 __I uint32_t STATF2;               /*GPIO Interrupt Status for Falling edge for Port 0.*/
 __O uint32_t CLR2;
 __IO uint32_t ENR2;
 __IO uint32_t ENF2;

}GPIO_INTERRUPT_TYPEDEF;

typedef struct
{
 __IO uint32_t CONTROL;                     /*Controls operation of the memory controller.*/
 __I uint32_t STATUS;                       /*Provides EMC status information*/
 __IO uint32_t CONFIG;                      /*Configures operation of the memory controller*/
 __IO uint8_t RESERVED0[0x14]; 
 __IO uint32_t DYNAMICCONTROL;              /*Controls dynamic memory operation.*/
 __IO uint32_t DYNAMICREFRESH;              /*Configures dynamic memory refresh*/
 __IO uint32_t DYNAMICREADCONFIG;           /*Configures dynamic memory read strategy.*/
 __IO uint32_t RESERVED1;
 __IO uint32_t DYNAMICRP;                   /*Precharge command period.*/
 __IO uint32_t DYNAMICRAS;                  /*Active to precharge command period.*/
 __IO uint32_t DYNAMICSREX;                 /*Self-refresh exit time.*/
 __IO uint32_t DYNAMICAPR;                  /*Last-data-out to active command time.*/
 __IO uint32_t DYNAMICDAL;                  /*Data-in to active command time.*/
 __IO uint32_t DYNAMICWR;                   /*Write recovery time.*/
 __IO uint32_t DYNAMICRC;                   /*Selects the active to active command period.*/
 __IO uint32_t DYNAMICRFC;                  /*Selects the auto-refresh period.*/
 __IO uint32_t DYNAMICXSR;                  /*Time for exit self-refresh to active command*/
 __IO uint32_t DYNAMICRRD;                  /*Latency for active bank A to active bank B*/
 __IO uint32_t DYNAMICMRD;                  /*Time for load mode register to active command.*/
 __IO uint8_t RESERVED2[0x24];
 __IO uint32_t STATICEXTENDEDWAIT;          /*Time for long static memory read and write transfers.*/
 __IO uint8_t RESERVED3[0x7C];
 __IO uint32_t DYNAMICCONFIG0;              /*Configuration information for EMC_DYCS0.*/
 __IO uint32_t DYNAMICRASCAS0;              /*RAS and CAS latencies for EMC_DYCS0. -*/
 __IO uint8_t RESERVED4[0x18];
 __IO uint32_t DYNAMICCONFIG1;              /*Configuration information for EMC_DYCS1.*/
 __IO uint32_t DYNAMICRASCAS1;              /*RAS and CAS latencies for EMC_DYCS1.*/
 __IO uint8_t RESERVED5[0x18];
 __IO uint32_t DYNAMICCONFIG2;              /*Configuration information for EMC_DYCS2*/
 __IO uint32_t DYNAMICRASCAS2;              /*RAS and CAS latencies for EMC_DYCS2*/
 __IO uint8_t RESERVED6[0x18];
 __IO uint32_t DYNAMICCONFIG3;              /*Configuration information for EMC_DYCS3.*/
 __IO uint32_t DYNAMICRASCAS3;              /*RAS and CAS latencies for EMC_DYCS3.*/
 __IO uint8_t RESERVED7[0x98];
 __IO uint32_t STATICCONFIG0;               /*Configuration for EMC_CS0.*/
 __IO uint32_t STATICWAITWEN0;              /*Delay from EMC_CS0 to write enable*/
 __IO uint32_t STATICWAITOEN0;              /*Delay from EMC_CS0 or address change,whichever is later, to output enable*/
 __IO uint32_t STATICWAITRD0;               /*Delay from EMC_CS0 to a read access.*/
 __IO uint32_t STATICWAITPAGE0;             /*Delay for asynchronous page mode sequential accesses for EMC_CS0.*/
 __IO uint32_t STATICWAITWR0;               /*Delay from EMC_CS0 to a write access.*/
 __IO uint32_t STATICWAITTURN0;             /*Number of bus turnaround cycles EMC_CS0.*/
 __IO uint32_t RESERVED8;
 __IO uint32_t STATICCONFIG1;               /*Memory configuration for EMC_CS1.*/
 __IO uint32_t STATICWAITWEN1;              /*Delay from EMC_CS1 to write enable*/
 __IO uint32_t STATICWAITOEN1;              /*Delay from EMC_CS1 or address change,whichever is later, to output enable*/
 __IO uint32_t STATICWAITRD1;               /*Delay from EMC_CS1 to a read access.*/
 __IO uint32_t STATICWAITPAGE1;             /*Delay for asynchronous page mode sequential accesses for EMC_CS1.*/
 __IO uint32_t STATICWAITWR1;               /*Delay from EMC_CS1 to a write access.*/
 __IO uint32_t STATICWAITTURN1;             /*Bus turnaround cycles for EMC_CS1.*/
 __IO uint32_t RESERVED9;
 __IO uint32_t STATICCONFIG2;               /*Memory configuration for EMC_CS2.*/
 __IO uint32_t STATICWAITWEN2;              /*Delay from EMC_CS2 to write enable.*/
 __IO uint32_t STATICWAITOEN2;              /*Delay from EMC_CS2 or address change,whichever is later, to output enable.*/
 __IO uint32_t STATICWAITRD2;               /*Delay from EMC_CS2 to a read access.*/
 __IO uint32_t STATICWAITPAGE2;             /*Delay for asynchronous page mode sequential accesses for EMC_CS2.*/
 __IO uint32_t STATICWAITWR2;               /*Delay from EMC_CS2 to a write access.*/
 __IO uint32_t EMCStaticWaitTurn2;          /*Bus turnaround cycles for EMC_CS2.*/
 __IO uint32_t RESERVED10;
 __IO uint32_t STATICCONFIG3;               /*Memory configuration for EMC_CS3*/
 __IO uint32_t STATICWAITWEN3;              /*Delay from EMC_CS3 to write enable.*/
 __IO uint32_t STATICWAITOEN3;              /*Delay from EMC_CS3 or address change,whichever is later, to output enable*/
 __IO uint32_t STATICWAITRD3;               /*Delay from EMC_CS3 to a read access.*/
 __IO uint32_t STATICWAITPAGE3;             /*Delay for asynchronous page mode sequential accesses for EMC_CS3.*/
 __IO uint32_t STATICWAITWR3;               /*Delay from EMC_CS3 to a write access.*/
 __IO uint32_t STATICWAITTURN3;             /*Bus turnaround cycles for EMC_CS3.*/
}EMC_TYPEDEF;

/****************************************************** ETHERNET **********************************************************************/

typedef struct
{
 __IO uint32_t MAC1;                         /*MAC configuration register 1.*/
 __IO uint32_t MAC2;                         /*MAC configuration register 2.*/
 __IO uint32_t IPGT;                         /*Back-to-Back Inter-Packet-Gap register*/
 __IO uint32_t IPGR;                         /*Non Back-to-Back Inter-Packet-Gap register*/
 __IO uint32_t CLRT;                         /*Collision window / Retry register.*/
 __IO uint32_t MAXF;                         /*Maximum Frame register.*/
 __IO uint32_t SUPP;                         /*PHY Support register*/
 __IO uint32_t TEST;                         /*Test register*/
 __IO uint32_t MCFG;                         /*MII Mgmt Configuration register*/
 __IO uint32_t MCMD;                         /*MII Mgmt Command register*/
 __IO uint32_t MADR;                         /*MII Mgmt Address register*/
 __O uint32_t MWTD;                          /*MII Mgmt Write Data register.*/
 __I uint32_t MRDD;                          /*MII Mgmt Read Data register*/
 __I uint32_t MIND;                          /*MII Mgmt Indicators register.*/
 __IO uint8_t RESERVED0[8];	
 __IO uint32_t SA0;                          /*Station Address 0 register.*/
 __IO uint32_t SA1;                          /*Station Address 1 register.*/
 __IO uint32_t SA2;                          /*Station Address 2 register.*/
 __IO uint8_t RESERVED1[0xB4];
 __IO uint32_t COMMAND;                      /*Command register*/
 __I uint32_t STATUS;                        /*Status register*/
 __IO uint32_t RXDESCRIPTOR;                 /*Receive descriptor base address register.*/
 __IO uint32_t RXSTATUS;                     /*Receive status base address register.*/
 __IO uint32_t RXDESCRIPTORNUMBER;           /*Receive number of descriptors register*/
 __I uint32_t RXPRODUCEINDEX;                /*Receive produce index register*/
 __IO uint32_t RXCONSUMEINDEX;               /*Receive consume index register*/
 __IO uint32_t TXDESCRIPTOR;                 /*Transmit descriptor base address register*/
 __IO uint32_t TXSTATUS;                     /*Transmit status base address register*/
 __IO uint32_t TXDESCRIPTORNUMBER;           /*Transmit number of descriptors register.*/
 __IO uint32_t TXPRODUCEINDEX;               /*TXPRODUCEINDEX*/
 __I uint32_t TXCONSUMEINDEX;                /*Transmit consume index register*/
 __IO uint8_t RESERVED2[0x28];             
 __I uint32_t TSV0;                          /*Transmit status vector 0 register.*/
 __I uint32_t TSV1;                          /*Transmit status vector 1 register.*/
 __I uint32_t RSV;                           /*Receive status vector register*/
 __IO uint8_t RESERVED3[0xC];
 __IO uint32_t FLOWCONTROLCOUNTER;           /*Flow control counter register*/
 __I uint32_t FLOWCONTROLSTATUS;             /*Flow control status register*/ 
 __IO uint8_t RESERVED4[0x88];
 __IO uint32_t RXFILTERCTRL;                 /*Receive filter control register*/
 __I uint32_t RXFILTERWOLSTATUS;             /*Receive filter WoL status register*/
 __O uint32_t RXFILTERWOLCLEAR;              /*Receive filter WoL clear register.*/
 __IO uint32_t RESERVED5;
 __IO uint32_t HASHFILTERL;                  /*Hash filter table LSBs register.*/
 __IO uint32_t HASHFILTERH;                  /*Hash filter table MSBs register*/
 __IO uint8_t RESERVED6[0xDC8];
 __I uint32_t INTSTATUS;                     /*Interrupt status register*/
 __IO uint32_t INTENABLE;                    /*Interrupt enable register*/
 __O uint32_t INTCLEAR;                      /*Interrupt clear register*/
 __O uint32_t INTSET;                        /*Interrupt set register*/
 __IO uint32_t POWERDOWN;                    /*Power-down register.*/
}ETHERNET_TYPEDEF;

