RajeshreeRinku/LPC400-header-file/lpc4088.h
/****************************************** LCD CONTROLLER ****************************************************************************/

typedef struct
{
 __IO uint32_t TIMH;                          /*Horizontal Timing Control register*/
 __IO uint32_t TIMV;                          /*Vertical Timing Control register*/
 __IO uint32_t POL;                           /*Clock and Signal Polarity Control register*/
 __IO uint32_t LE;                            /*Line End Control register*/
 __IO uint32_t UPBASE;                        /*Upper Panel Frame Base Address register*/
 __IO uint32_t LPBASE;                        /*Lower Panel Frame Base Address register*/
 __IO uint32_t CTRL;                          /*LCD Control register*/
 __IO uint32_t INTMSK;                        /*Interrupt Mask register*/
 __I uint32_t INTRAW;                         /*Raw Interrupt Status register*/
 __I uint32_t INTSTAT;                        /*Masked Interrupt Status register*/
 __O uint32_t INTCLR;                         /*Interrupt Clear register*/
 __I uint32_t UPCURR;                         /*Upper Panel Current Address Value register*/
 __I uint32_t LPCURR;                         /*Lower Panel Current Address Value register*/
 __IO uint8_t RESERVED0[0x1CC];
	
 __IO uint32_t PAL0;                           /*256x16-bit Color Palette registers*/
 __IO uint32_t PAL1;                           /*256x16-bit Color Palette registers*/
 __IO uint32_t PAL2;                           /*256x16-bit Color Palette registers*/
 __IO uint32_t PAL3;                           /*256x16-bit Color Palette registers*/
 __IO uint32_t PAL4;                           /*256x16-bit Color Palette registers*/
 __IO uint32_t PAL5;                           /*256x16-bit Color Palette registers*/
 __IO uint32_t PAL6;                           /*256x16-bit Color Palette registers*/
 __IO uint32_t PAL7;                           /*256x16-bit Color Palette registers*/
 __IO uint32_t PAL8;                           /*256x16-bit Color Palette registers*/
 __IO uint32_t PAL9;                           /*256x16-bit Color Palette registers*/
 __IO uint32_t PAL10;                           /*256x16-bit Color Palette registers*/
 __IO uint32_t PAL11;                           /*256x16-bit Color Palette registers*/
 __IO uint32_t PAL12;                           /*256x16-bit Color Palette registers*/
 __IO uint32_t PAL13;                           /*256x16-bit Color Palette registers*/
 __IO uint32_t PAL14;                           /*256x16-bit Color Palette registers*/
 __IO uint32_t PAL15;                           /*256x16-bit Color Palette registers*/
 __IO uint32_t PAL16;                           /*256x16-bit Color Palette registers*/
 __IO uint32_t PAL17;                           /*256x16-bit Color Palette registers*/
 __IO uint32_t PAL18;                           /*256x16-bit Color Palette registers*/
 __IO uint32_t PAL19;                           /*256x16-bit Color Palette registers*/
 __IO uint32_t PAL20;                           /*256x16-bit Color Palette registers*/
 __IO uint32_t PAL21;                           /*256x16-bit Color Palette registers*/
 __IO uint32_t PAL22;                           /*256x16-bit Color Palette registers*/
 __IO uint32_t PAL23;                           /*256x16-bit Color Palette registers*/
 __IO uint32_t PAL24;                           /*256x16-bit Color Palette registers*/
 __IO uint32_t PAL25;                           /*256x16-bit Color Palette registers*/
 __IO uint32_t PAL26;                           /*256x16-bit Color Palette registers*/
 __IO uint32_t PAL27;                           /*256x16-bit Color Palette registers*/
 __IO uint32_t PAL28;                           /*256x16-bit Color Palette registers*/
 __IO uint32_t PAL29;                           /*256x16-bit Color Palette registers*/
 __IO uint32_t PAL30;                           /*256x16-bit Color Palette registers*/
 __IO uint32_t PAL31;                           /*256x16-bit Color Palette registers*/
 __IO uint32_t PAL32;                           /*256x16-bit Color Palette registers*/
 __IO uint32_t PAL33;                           /*256x16-bit Color Palette registers*/
 __IO uint32_t PAL34;                           /*256x16-bit Color Palette registers*/
 __IO uint32_t PAL35;                           /*256x16-bit Color Palette registers*/
 __IO uint32_t PAL36;                           /*256x16-bit Color Palette registers*/
 __IO uint32_t PAL37;                           /*256x16-bit Color Palette registers*/
 __IO uint32_t PAL38;                           /*256x16-bit Color Palette registers*/
 __IO uint32_t PAL39;                           /*256x16-bit Color Palette registers*/
 __IO uint32_t PAL40;                           /*256x16-bit Color Palette registers*/
 __IO uint32_t PAL41;                           /*256x16-bit Color Palette registers*/
 __IO uint32_t PAL42;                           /*256x16-bit Color Palette registers*/
 __IO uint32_t PAL43;                           /*256x16-bit Color Palette registers*/
 __IO uint32_t PAL44;                           /*256x16-bit Color Palette registers*/
 __IO uint32_t PAL45;                           /*256x16-bit Color Palette registers*/
 __IO uint32_t PAL46;                           /*256x16-bit Color Palette registers*/
 __IO uint32_t PAL47;                           /*256x16-bit Color Palette registers*/
 __IO uint32_t PAL48;                           /*256x16-bit Color Palette registers*/
 __IO uint32_t PAL49;                           /*256x16-bit Color Palette registers*/
 __IO uint32_t PAL50;                           /*256x16-bit Color Palette registers*/
 __IO uint32_t PAL51;                           /*256x16-bit Color Palette registers*/
 __IO uint32_t PAL52;                           /*256x16-bit Color Palette registers*/
 __IO uint32_t PAL53;                           /*256x16-bit Color Palette registers*/
 __IO uint32_t PAL54;                           /*256x16-bit Color Palette registers*/
 __IO uint32_t PAL55;                           /*256x16-bit Color Palette registers*/
 __IO uint32_t PAL56;                           /*256x16-bit Color Palette registers*/
 __IO uint32_t PAL57;                           /*256x16-bit Color Palette registers*/
 __IO uint32_t PAL58;                           /*256x16-bit Color Palette registers*/
 __IO uint32_t PAL59;                           /*256x16-bit Color Palette registers*/
 __IO uint32_t PAL60;                           /*256x16-bit Color Palette registers*/
 __IO uint32_t PAL61;                           /*256x16-bit Color Palette registers*/
 __IO uint32_t PAL62;                           /*256x16-bit Color Palette registers*/
 __IO uint32_t PAL63;                           /*256x16-bit Color Palette registers*/
 __IO uint32_t PAL64;                           /*256x16-bit Color Palette registers*/
 __IO uint32_t PAL65;                           /*256x16-bit Color Palette registers*/
 __IO uint32_t PAL66;                           /*256x16-bit Color Palette registers*/
 __IO uint32_t PAL67;                           /*256x16-bit Color Palette registers*/
 __IO uint32_t PAL68;                           /*256x16-bit Color Palette registers*/
 __IO uint32_t PAL69;                           /*256x16-bit Color Palette registers*/
 __IO uint32_t PAL70;                           /*256x16-bit Color Palette registers*/
 __IO uint32_t PAL71;                           /*256x16-bit Color Palette registers*/
 __IO uint32_t PAL72;                           /*256x16-bit Color Palette registers*/
 __IO uint32_t PAL73;                           /*256x16-bit Color Palette registers*/
 __IO uint32_t PAL74;                           /*256x16-bit Color Palette registers*/
 __IO uint32_t PAL75;                           /*256x16-bit Color Palette registers*/
 __IO uint32_t PAL76;                           /*256x16-bit Color Palette registers*/
 __IO uint32_t PAL77;                           /*256x16-bit Color Palette registers*/
 __IO uint32_t PAL78;                           /*256x16-bit Color Palette registers*/
 __IO uint32_t PAL79;                           /*256x16-bit Color Palette registers*/
 __IO uint32_t PAL80;                           /*256x16-bit Color Palette registers*/
 __IO uint32_t PAL81;                           /*256x16-bit Color Palette registers*/
 __IO uint32_t PAL82;                           /*256x16-bit Color Palette registers*/
 __IO uint32_t PAL83;                           /*256x16-bit Color Palette registers*/
 __IO uint32_t PAL84;                           /*256x16-bit Color Palette registers*/
 __IO uint32_t PAL85;                           /*256x16-bit Color Palette registers*/
 __IO uint32_t PAL86;                           /*256x16-bit Color Palette registers*/
 __IO uint32_t PAL87;                           /*256x16-bit Color Palette registers*/
 __IO uint32_t PAL88;                           /*256x16-bit Color Palette registers*/
 __IO uint32_t PAL89;                           /*256x16-bit Color Palette registers*/
 __IO uint32_t PAL90;                           /*256x16-bit Color Palette registers*/
 __IO uint32_t PAL91;                           /*256x16-bit Color Palette registers*/
 __IO uint32_t PAL92;                           /*256x16-bit Color Palette registers*/
 __IO uint32_t PAL93;                           /*256x16-bit Color Palette registers*/
 __IO uint32_t PAL94;                           /*256x16-bit Color Palette registers*/
 __IO uint32_t PAL95;                           /*256x16-bit Color Palette registers*/
 __IO uint32_t PAL96;                           /*256x16-bit Color Palette registers*/
 __IO uint32_t PAL97;                           /*256x16-bit Color Palette registers*/
 __IO uint32_t PAL98;                           /*256x16-bit Color Palette registers*/
 __IO uint32_t PAL99;                           /*256x16-bit Color Palette registers*/
 __IO uint32_t PAL100;                           /*256x16-bit Color Palette registers*/
 __IO uint32_t PAL101;                           /*256x16-bit Color Palette registers*/
 __IO uint32_t PAL102;                           /*256x16-bit Color Palette registers*/
 __IO uint32_t PAL103;                           /*256x16-bit Color Palette registers*/
 __IO uint32_t PAL104;                           /*256x16-bit Color Palette registers*/
 __IO uint32_t PAL105;                           /*256x16-bit Color Palette registers*/
 __IO uint32_t PAL106;                           /*256x16-bit Color Palette registers*/
 __IO uint32_t PAL107;                           /*256x16-bit Color Palette registers*/
 __IO uint32_t PAL108;                           /*256x16-bit Color Palette registers*/
 __IO uint32_t PAL109;                           /*256x16-bit Color Palette registers*/
 __IO uint32_t PAL110;                           /*256x16-bit Color Palette registers*/
 __IO uint32_t PAL111;                           /*256x16-bit Color Palette registers*/
 __IO uint32_t PAL112;                           /*256x16-bit Color Palette registers*/
 __IO uint32_t PAL113;                           /*256x16-bit Color Palette registers*/
 __IO uint32_t PAL114;                           /*256x16-bit Color Palette registers*/
 __IO uint32_t PAL115;                           /*256x16-bit Color Palette registers*/
 __IO uint32_t PAL116;                           /*256x16-bit Color Palette registers*/
 __IO uint32_t PAL117;                           /*256x16-bit Color Palette registers*/
 __IO uint32_t PAL118;                           /*256x16-bit Color Palette registers*/
 __IO uint32_t PAL119;                           /*256x16-bit Color Palette registers*/
 __IO uint32_t PAL120;                           /*256x16-bit Color Palette registers*/
 __IO uint32_t PAL121;                           /*256x16-bit Color Palette registers*/
 __IO uint32_t PAL122;                           /*256x16-bit Color Palette registers*/
 __IO uint32_t PAL123;                           /*256x16-bit Color Palette registers*/
 __IO uint32_t PAL124;                           /*256x16-bit Color Palette registers*/
 __IO uint32_t PAL125;                           /*256x16-bit Color Palette registers*/
 __IO uint32_t PAL126;                           /*256x16-bit Color Palette registers*/
 __IO uint32_t PAL127;                           /*256x16-bit Color Palette registers*/

 __IO uint8_t RESERVED1[0x400];

