RajeshreeRinku/LPC400-header-file/lpc4088.h
 __IO uint32_t CRSR_IMG0;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG1;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG2;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG3;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG4;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG5;                        /*Cursor Image registers*/ 
 __IO uint32_t CRSR_IMG6;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG7;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG8;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG9;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG10;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG11;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG12;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG13;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG14;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG15;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG16;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG17;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG18;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG19;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG20;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG21;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG22;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG23;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG24;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG25;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG26;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG27;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG28;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG29;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG30;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG31;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG32;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG33;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG34;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG35;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG36;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG37;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG38;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG39;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG40;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG41;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG42;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG43;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG44;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG45;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG46;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG47;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG48;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG49;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG50;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG51;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG52;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG53;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG54;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG55;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG56;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG57;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG58;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG59;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG60;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG61;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG62;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG63;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG64;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG65;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG66;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG67;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG68;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG69;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG70;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG71;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG72;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG73;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG74;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG75;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG76;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG77;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG78;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG79;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG80;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG81;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG82;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG83;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG84;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG85;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG86;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG87;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG88;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG89;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG90;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG91;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG92;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG93;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG94;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG95;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG96;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG97;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG98;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG99;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG100;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG101;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG102;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG103;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG104;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG105;                        /*Cursor Image registers*/ 
 __IO uint32_t CRSR_IMG106;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG107;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG108;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG109;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG110;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG111;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG112;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG113;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG114;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG115;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG116;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG117;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG118;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG119;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG120;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG121;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG122;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG123;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG124;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG125;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG126;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG127;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG128;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG129;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG130;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG131;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG132;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG133;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG134;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG135;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG136;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG137;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG138;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG139;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG140;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG141;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG142;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG143;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG144;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG145;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG146;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG147;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG148;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG149;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG150;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG151;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG152;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG153;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG154;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG155;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG156;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG157;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG158;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG159;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG160;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG161;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG162;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG163;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG164;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG165;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG166;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG167;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG168;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG169;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG170;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG171;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG172;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG173;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG174;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG175;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG176;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG177;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG178;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG179;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG180;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG181;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG182;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG183;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG184;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG185;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG186;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG187;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG188;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG189;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG190;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG191;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG192;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG193;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG194;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG195;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG196;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG197;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG198;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG199;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG200;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG201;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG202;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG203;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG204;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG205;                        /*Cursor Image registers*/ 
 __IO uint32_t CRSR_IMG206;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG207;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG208;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG209;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG210;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG211;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG212;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG213;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG214;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG215;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG216;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG217;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG218;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG219;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG220;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG221;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG222;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG223;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG224;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG225;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG226;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG227;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG228;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG229;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG230;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG231;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG232;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG233;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG234;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG235;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG236;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG237;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG238;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG239;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG240;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG241;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG242;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG243;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG244;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG245;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG246;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG247;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG248;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG249;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG250;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG251;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG252;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG253;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG254;                        /*Cursor Image registers*/
 __IO uint32_t CRSR_IMG255;                        /*Cursor Image registers*/
 
 __IO uint32_t CRSR_CTRL;                          /*Cursor Control register*/
 __IO uint32_t CRSR_CFG;                           /*Cursor Configuration register*/
 __IO uint32_t CRSR_PAL0;                          /*Cursor Palette register 0*/
 __IO uint32_t CRSR_PAL1;                          /*Cursor Palette register 1*/
 __IO uint32_t CRSR_XY;                            /*Cursor XY Position register*/
 __IO uint32_t CRSR_CLIP;                          /*Cursor Clip Position register*/
 __IO uint32_t CRSR_INTMSK;                        /*Cursor Interrupt Mask register*/
 __O uint32_t CRSR_INTCLR;                         /*Cursor Interrupt Clear register*/
 __I uint32_t CRSR_INTRAW;                         /*Cursor Raw Interrupt Status register*/
 __I uint32_t CRSR_INTSTAT;                        /*Cursor Masked Interrupt Status register*/
}LCD_CONTROLLER_TYPEDEF;

/***************************************** USB device controller **********************************************************************/

