RajeshreeRinku/LPC400-header-file/lpc4088.h
typedef struct
{
 __IO uint32_t PORTSEL;                           /*USB Port Select. This register is also used for OTG configuration. In device-only operations only bits 0 and 1 of
                                                    this register are*/
 __IO uint8_t RESERVED0[0xEC];
 __I uint32_t DEVINTST;                           /*USB Device Interrupt Status*/
 __IO uint32_t DEVINTEN;                          /*USB Device Interrupt Enable*/
 __O uint32_t DEVINTCLR;                          /*USB Device Interrupt Clear*/
 __O uint32_t DEVINTSET;                          /*USB Device Interrupt Set*/
 __O uint32_t CMDCODE;                            /*USB Command Code*/
 __I uint32_t CMDDATA;                            /*USB Command Data*/
 __I uint32_t RXDATA;                             /*USB Receive Data*/
 __O uint32_t TXDATA;                             /*USB Transmit Data*/
 __I uint32_t RXPLEN;                             /*USB Receive Packet Length*/
 __O uint32_t TXPLEN;                             /*USB Transmit Packet Length*/
 __IO uint32_t CTRL;                              /*USB Control*/
 __O uint32_t DEVINTPRI;                          /*USB Device Interrupt Priority*/
 __I uint32_t EPINTST;                            /*USB Endpoint Interrupt Status*/
 __IO uint32_t EPINTEN;                           /*USB Endpoint Interrupt Enable*/
 __O uint32_t EPINTCLR;                           /*USB Endpoint Interrupt Clear*/
 __O uint32_t EPINTSET;                           /*USB Endpoint Interrupt Set*/
 __O uint32_t EPINTPRI;                           /*USB Endpoint Priority*/
 __IO uint32_t REEP;                              /*USB Realize Endpoint*/
 __O uint32_t EPIN;                               /*USB Endpoint Index*/
 __IO uint32_t MAXPSIZE;                          /*USB MaxPacketSize*/
 __I uint32_t DMARST;                             /*USB DMA Request Status*/
 __O uint32_t DMARCLR;                            /*USB DMA Request Clear*/
 __O uint32_t DMARSET;                            /*USB DMA Request Set*/
 __IO uint8_t RESERVED1[0x24];
 __IO uint32_t UDCAH;                             /*USB UDCA Head*/
 __I uint32_t EPDMAST;                            /*USB Endpoint DMA Status*/
 __O uint32_t EPDMAEN;                            /*USB Endpoint DMA Enable*/
 __O uint32_t EPDMADIS;                           /*USB Endpoint DMA Disable*/
 __I uint32_t DMAINTST;                           /*USB DMA Interrupt Status*/
 __IO uint32_t DMAINTEN;                          /*USB DMA Interrupt Enable*/
 __IO uint8_t RSESEVED2[8];      
 __I uint32_t EOTINTST;                           /*USB End of Transfer Interrupt Status*/
 __O uint32_t EOTINTCLR;                          /*USB End of Transfer Interrupt Clear*/
 __O uint32_t EOTINTSET;                          /*USB End of Transfer Interrupt Set*/
 __I uint32_t NDDRINTST;                          /*USB New DD Request Interrupt Status*/
 __O uint32_t NDDRINTCLR;                         /*USB New DD Request Interrupt Clear*/
 __O uint32_t NDDRINTSET;                         /*USB New DD Request Interrupt Set*/
 __I uint32_t SYSERRINTST;                        /*USB System Error Interrupt Status*/
 __O uint32_t SYSERRINTCLR;                       /*USB System Error Interrupt Clear*/
 __O uint32_t SYSERRINTSET;                       /*USB System Error Interrupt Set*/
 __IO uint8_t RESERVED3[0xD30];
 __IO uint32_t CLKCTRL;                           /*USB Clock Control*/
 __I uint32_t CLKST;                              /*USB Clock Status*/ 
}USB_DEVICE_CONTROLLER_TYPEDEF;

/************************************************* USB HOST CONTROLLER *****************************************************************/

typedef struct
{
 __I uint32_t HcRevision;                          /*BCD representation of the version of the HCI specification that is implemented by the Host Controller*/
 __IO uint32_t HcControl;                          /*Defines the operating modes of the HC.*/
 __IO uint32_t HcCommandStatus;                    /*This register is used to receive the commands from the Host Controller Driver (HCD). It also indicates the status of the HC*/
 __IO uint32_t HcInterruptStatus;                  /*Indicates the status on various events that cause hardware interrupts by setting the appropriate bits.*/
 __IO uint32_t HcInterruptEnable;                  /*Controls the bits in the HcInterruptStatus register and indicates which events will generate a hardware interrupt.*/
 __IO uint32_t HcInterruptDisable;                 /*The bits in this register are used to disable corresponding bits in the HCInterruptStatus register and in turn disable that event leading to hardware interrupt.*/
 __IO uint32_t HcHCCA;                             /*Contains the physical address of the host controller communication area.*/
 __I uint32_t HcPeriodCurrentED;                   /*Contains the physical address of the current isochronous or interrupt endpoint descriptor*/
 __IO uint32_t HcControlHeadED;                    /*Contains the physical address of the first endpoint descriptor of the control list.*/
 __IO uint32_t HcControlCurrentED;                 /*Contains the physical address of the current endpoint descriptor of the control list*/
 __IO uint32_t HcBulkHeadED;                       /*Contains the physical address of the first endpoint descriptor of the bulk list.*/
 __IO uint32_t HcBulkCurrentED;                    /*Contains the physical address of the current endpoint descriptor of the bulk list.*/
 __I uint32_t HcDoneHead;                          /*Contains the physical address of the last transfer descriptor added to the ‘Done’ queue.*/
 __IO uint32_t HcFmInterval;                       /*Defines the bit time interval in a frame and the full speed maximum packet size which would not cause an overrun.*/
 __I uint32_t HcFmRemaining;                       /*A 14-bit counter showing the bit time remaining in the current frame*/
 __I uint32_t HcFmNumber;                          /*Contains a 16-bit counter and provides the timing reference among events happening in the HC and the HCD*/
 __IO uint32_t HcPeriodicStart;                    /*Contains a programmable 14-bit value which determines the earliest time HC should start processing a periodic list*/
 __IO uint32_t HcLSThreshold;                      /*Contains 11-bit value which is used by the HC to determine whether to commit to transfer a maximum of 8-byte LS packet before EOF*/
 __IO uint32_t HcRhDescriptorA;                    /*First of the two registers which describes the characteristics of the root hub.*/
 __IO uint32_t HcRhDescriptorB;                    /*Second of the two registers which describes the characteristics of the Root Hub.*/
 __IO uint32_t HcRhStatus;                         /*This register is divided into two parts. The lower D-word represents the hub status field and the upper word represents the hub status change field.*/
 __IO uint32_t HcRhPortStatus1;                    /*Controls and reports the port events on a per-port basis*/
 __IO uint32_t HcRhPortStatus2;                    /*Controls and reports the port events on a per port basis.*/
 __IO uint8_t RESERVED0[0xA0]; 
 __I uint32_t Module_ID_OR_Ver_Rev_ID;             /*IP number, where yy (0x00) is unique version number and zz (0x00) is a unique revision number*/
}USB_HOST_CONTROLLER_TYPEDEF;

/************************************************* USB OTG controller ****************************************************************/
typedef struct 
{
 /*$$$$$$$$$$$$$$$$ OTG Registers $$$$$$$$$$$$$$$$*/
	__I uint32_t INTST;                             /*OTG Interrupt Status*/
	__IO uint32_t INTEN;                            /*OTG Interrupt Enable*/
	__O uint32_t INTSET;                            /*OTG Interrupt Set*/
	__O uint32_t INTCLR;                            /*OTG Interrupt Clear*/
	__IO uint32_t PORTSEL;                          /*OTG Status and Control and USB port select*/
  __IO uint32_t TMR;                              /*OTG Timer*/
	
  __IO uint8_t RESERVED0[0x1E8];
	 union I2C_
	 {
		 __I uint32_t I2C_RX;                        /*I2C Receive*/
		 __O uint32_t I2C_TX;                        /*I2C Transmit*/
	 }USB_OTG_CONTROLLER_TYPEDEF_I2C;
	 __I uint32_t I2C_STS;                         /*I2C Status*/
	 __IO uint32_t I2C_CTL;                        /*I2C Control*/
	 __IO uint32_t I2C_CLKHI;                      /*I2C Clock High*/
	 __IO uint32_t I2C_CLKLO;                      /*I2C Clock Low*/
	 __IO uint8_t RESERVED1[0xCE0];
	 __IO uint32_t CLKCTRL;                        /*OTG clock controller*/
	 __I uint32_t CLKST;                /*OTG clock status*/
}USB_OTG_CONTROLLER_TYPEDEF;

/***************************************************** SD card interface **********************************************************************************/
typedef struct
{
 __IO uint32_t PWR;                             /*Power control register*/
 __IO uint32_t CLOCK;                           /*Clock control register.*/
 __IO uint32_t ARGUMENT;                        /*Argument register.*/
 __IO uint32_t COMMAND;                         /*Command register.*/
 __I uint32_t RESPCMD;                          /*Response command register*/
 __I uint32_t RESPONSE0;                        /*Response register.*/
 __I uint32_t RESPONSE1;                        /*Response register.*/
 __I uint32_t RESPONSE2;                        /*Response register.*/
 __I uint32_t RESPONSE3;                        /*Response register.*/
 __IO uint32_t DATATIMER;                       /*Data Timer*/
 __IO uint32_t DATALENGTH;                      /*Data length register.*/
 __IO uint32_t DATACTRL;                        /*Data control register*/
 __I uint32_t DATACNT;                          /*Data counter.*/
 __I uint32_t STATUS;                           /*Status register.*/
 __O uint32_t CLEAR;                            /*Clear register*/
 __IO uint32_t MASK0;                           /*Interrupt 0 mask register.*/
 __IO uint8_t RESERVED0[0x40];               
 __IO uint32_t FIFO[0xF];                       /*Data FIFO Register*/
 __IO uint8_t RESERVED1[0x3F88];
 __I uint32_t FIFOCNT;                          /*FIFO Counter.*/
}SD_CARD_INTERFACE_TYPEDEF;

/************************************************* UART1 *******************************************************************************/

typedef struct
{
	union{
 __I uint32_t RBR;                              /*DLAB =0. Receiver Buffer Register. Contains the next received character to be read.*/
 __O uint32_t THR;                              /*DLAB =0. Transmit Holding Register. The next character to be transmitted is written here.*/
 __IO uint32_t DLL;}UN1;                        /*DLAB =1. Divisor Latch LSB. Least significant byte of the baud rate divisor value. The full divisor is used to generate a baud
                                                  rate from the fractional rate divider.*/
 union {
 __IO uint32_t DLM;                             /*DLAB =1. Divisor Latch MSB. Most significant byte of the baud rate divisor value. The full divisor is used to generate a baud
                                                  rate from the fractional rate divider.*/
 __IO uint32_t IER;                             /*DLAB =0. Interrupt Enable Register. Contains individual interrupt enable bits for the 7 potential UART1 interrupts*/
 
