RajeshreeRinku/LPC400-header-file/lpc4088.h
 }UN2;
 union {
 __I uint32_t IIR;                              /*Interrupt ID Register. Identifies which interrupt(s) are pending.*/
 __O uint32_t FCR;                              /*FIFO Control Register. Controls UART1 FIFO usage and modes.*/
 }UN3;
 __IO uint32_t LCR;                             /*Line Control Register. Contains controls for frame formatting and break generation*/
 __IO uint32_t MCR;                             /*Modem Control Register. Contains controls for flow control handshaking and loopback mode*/
 __I uint32_t LSR;                              /*Line Status Register. Contains flags for transmit and receive status, including line errors*/
 __I uint32_t MSR;                              /*Modem Status Register. Contains handshake signal status flags.*/
 __IO uint32_t SCR;                             /*Scratch Pad Register. 8-bit temporary storage for software*/
 __IO uint32_t ACR;                             /*Auto-baud Control Register. Contains controls for the auto-baud feature*/
 __IO uint32_t RESERVED0;
 __IO uint32_t FDR;                             /*Fractional Divider Register. Generates a clock input for the baud rate divider*/
 __IO uint32_t RESERVED1;
 __IO uint32_t TER;                             /*Transmit Enable Register. Turns off UART transmitter for use with software flow control*/
 __IO uint8_t RESERVED[0x18];
 __IO uint32_t RS485CTRL;                       /*RS-485/EIA-485 Control. Contains controls to configure various aspects of RS-485/EIA-485 modes*/
 __IO uint32_t RSADRMATCH;                      /*RS-485/EIA-485 address match. Contains the address match value for RS-485/EIA-485 mode*/
 __IO uint32_t RS485DLY;                        /*RS-485/EIA-485 direction control delay.*/
}UART1_TYPEDEF;

/*************************************************** UART0 ****************************************************************************/

typedef struct
{
union{
 __I uint32_t RBR;                              /*DLAB =0. Receiver Buffer Register. Contains the next received character to be read.*/
 __O uint32_t THR;                              /*DLAB =0. Transmit Holding Register. The next character to be transmitted is written here.*/
 __IO uint32_t DLL;}UN1;                        /*DLAB =1. Divisor Latch LSB. Least significant byte of the baud rate divisor value. The full divisor is used to generate a baud
                                                  rate from the fractional rate divider.*/
 union {
 __IO uint32_t DLM;                             /*DLAB =1. Divisor Latch MSB. Most significant byte of the baud rate divisor value. The full divisor is used to generate a baud
                                                  rate from the fractional rate divider.*/
 __IO uint32_t IER;                             /*DLAB =0. Interrupt Enable Register. Contains individual interrupt enable bits for the 7 potential UART1 interrupts*/
 
 }UN2;
 union {
 __I uint32_t IIR;                              /*Interrupt ID Register. Identifies which interrupt(s) are pending.*/
 __O uint32_t FCR;                              /*FIFO Control Register. Controls UART1 FIFO usage and modes.*/
 }UN3;
 __IO uint32_t LCR;                             /*Line Control Register. Contains controls for frame formatting and break generation*/
 __IO uint32_t RESERVED2;                             /*Modem Control Register. Contains controls for flow control handshaking and loopback mode*/
 __I uint32_t LSR;                              /*Line Status Register. Contains flags for transmit and receive status, including line errors*/
 __I uint32_t RESERVED3;                              /*Modem Status Register. Contains handshake signal status flags.*/
 __IO uint32_t SCR;                             /*Scratch Pad Register. 8-bit temporary storage for software*/
 __IO uint32_t ACR;                             /*Auto-baud Control Register. Contains controls for the auto-baud feature*/
 __IO uint32_t RESERVED0;
 __IO uint32_t FDR;                             /*Fractional Divider Register. Generates a clock input for the baud rate divider*/
 __IO uint32_t RESERVED1;
 __IO uint32_t TER;                             /*Transmit Enable Register. Turns off UART transmitter for use with software flow control*/
 __IO uint8_t RESERVED[0x18];
 __IO uint32_t RS485CTRL;                       /*RS-485/EIA-485 Control. Contains controls to configure various aspects of RS-485/EIA-485 modes*/
 __IO uint32_t RSADRMATCH;                      /*RS-485/EIA-485 address match. Contains the address match value for RS-485/EIA-485 mode*/
 __IO uint32_t RS485DLY;                        /*RS-485/EIA-485 direction control delay.*/	
}UART0_TYPEDEF;

/*************************************************** UART2 ****************************************************************************/

typedef struct
{
union{
 __I uint32_t RBR;                              /*DLAB =0. Receiver Buffer Register. Contains the next received character to be read.*/
 __O uint32_t THR;                              /*DLAB =0. Transmit Holding Register. The next character to be transmitted is written here.*/
 __IO uint32_t DLL;}UN1;                        /*DLAB =1. Divisor Latch LSB. Least significant byte of the baud rate divisor value. The full divisor is used to generate a baud
                                                  rate from the fractional rate divider.*/
 union {
 __IO uint32_t DLM;                             /*DLAB =1. Divisor Latch MSB. Most significant byte of the baud rate divisor value. The full divisor is used to generate a baud
                                                  rate from the fractional rate divider.*/
 __IO uint32_t IER;                             /*DLAB =0. Interrupt Enable Register. Contains individual interrupt enable bits for the 7 potential UART1 interrupts*/
 
 }UN2;
 union {
 __I uint32_t IIR;                              /*Interrupt ID Register. Identifies which interrupt(s) are pending.*/
 __O uint32_t FCR;                              /*FIFO Control Register. Controls UART1 FIFO usage and modes.*/
 }UN3;
 __IO uint32_t LCR;                             /*Line Control Register. Contains controls for frame formatting and break generation*/
 __IO uint32_t RESERVED2;                             /*Modem Control Register. Contains controls for flow control handshaking and loopback mode*/
 __I uint32_t LSR;                              /*Line Status Register. Contains flags for transmit and receive status, including line errors*/
 __I uint32_t RESERVED3;                              /*Modem Status Register. Contains handshake signal status flags.*/
 __IO uint32_t SCR;                             /*Scratch Pad Register. 8-bit temporary storage for software*/
 __IO uint32_t ACR;                             /*Auto-baud Control Register. Contains controls for the auto-baud feature*/
 __IO uint32_t RESERVED0;
 __IO uint32_t FDR;                             /*Fractional Divider Register. Generates a clock input for the baud rate divider*/
 __IO uint32_t RESERVED1;
 __IO uint32_t TER;                             /*Transmit Enable Register. Turns off UART transmitter for use with software flow control*/
 __IO uint8_t RESERVED[0x18];
 __IO uint32_t RS485CTRL;                       /*RS-485/EIA-485 Control. Contains controls to configure various aspects of RS-485/EIA-485 modes*/
 __IO uint32_t RSADRMATCH;                      /*RS-485/EIA-485 address match. Contains the address match value for RS-485/EIA-485 mode*/
 __IO uint32_t RS485DLY;                        /*RS-485/EIA-485 direction control delay.*/	
}UART2_TYPEDEF;

