RajeshreeRinku/LPC400-header-file/lpc4088.h
/*********************************************** CENTRAL CAN **************************************************************************/

typedef struct
{
 __I uint32_t TXSR;                             /*CAN Central Transmit Status Register*/
 __I uint32_t RXSR;                             /*CAN Central Receive Status Register*/
 __I uint32_t MSR;                              /*CAN Central Miscellaneous Register*/
}CENTRAL_CAN_TYPEDEF;

/**************************************************** CAN1 ****************************************************************************/

typedef struct
{
 __IO uint32_t MOD;                             /*Controls the operating mode of the CAN Controller*/
 __O uint32_t CMR;                              /*Command bits that affect the state of the CAN Controller*/
 __I uint32_t GSR;                              /*Global Controller Status and Error Counters. The error counters can only be written when RM in CANMOD is 1.*/
 __I uint32_t ICR;                              /*Interrupt status, Arbitration Lost Capture, Error Code Capture*/
 __IO uint32_t IER;                             /*Interrupt Enable*/
 __IO uint32_t BTR;                             /*Bus Timing. Can only be written when RM in CANMOD is 1.*/
 __IO uint32_t EWL;                             /*Error Warning Limit. Can only be written when RM in CANMOD is 1*/
 __I uint32_t SR;                               /*Status Register*/
 __IO uint32_t RFS;                             /*Receive frame status. Can only be written when RM in CANMOD is 1.*/
 __IO uint32_t RID;                             /*Received Identifier. Can only be written when RM in CANMOD is 1*/
 __IO uint32_t RDA;                             /*Received data bytes 1-4. Can only be written when RM in CANMOD is 1.*/
 __IO uint32_t RDB;                             /*Received data bytes 5-8. Can only be written when RM in CANMOD is 1.*/
 __IO uint32_t TFI1;                            /*Transmit frame info (Tx Buffer 1)*/
 __IO uint32_t TID1;                            /*Transmit Identifier (Tx Buffer 1)*/
 __IO uint32_t TDA1;                            /*Transmit data bytes 1-4 (Tx Buffer 1)*/
 __IO uint32_t TDB1;                            /*Transmit data bytes 5-8 (Tx Buffer 1)*/
 __IO uint32_t TFI2;                            /*Transmit frame info (Tx Buffer 2)*/
 __IO uint32_t TID2;                            /*Transmit Identifier (Tx Buffer 2)*/
 __IO uint32_t TDA2;                            /*Transmit data bytes 1-4 (Tx Buffer 2)*/
 __IO uint32_t TDB2;                            /*Transmit data bytes 5-8 (Tx Buffer 2)*/
 __IO uint32_t TFI3;                            /*Transmit frame info (Tx Buffer 3)*/
 __IO uint32_t TID3;                            /*Transmit Identifier (Tx Buffer 3)*/
 __IO uint32_t TDA3;                            /*Transmit data bytes 1-4 (Tx Buffer 3)*/
 __IO uint32_t TDB3;                            /*Transmit data bytes 5-8 (Tx Buffer 3)*/
}CAN1_TYPEDEF;

/**************************************************** CAN2 ****************************************************************************/

typedef struct
{
 __IO uint32_t MOD;                             /*Controls the operating mode of the CAN Controller*/
 __O uint32_t CMR;                              /*Command bits that affect the state of the CAN Controller*/
 __I uint32_t GSR;                              /*Global Controller Status and Error Counters. The error counters can only be written when RM in CANMOD is 1.*/
 __I uint32_t ICR;                              /*Interrupt status, Arbitration Lost Capture, Error Code Capture*/
 __IO uint32_t IER;                             /*Interrupt Enable*/
 __IO uint32_t BTR;                             /*Bus Timing. Can only be written when RM in CANMOD is 1.*/
 __IO uint32_t EWL;                             /*Error Warning Limit. Can only be written when RM in CANMOD is 1*/
 __I uint32_t SR;                               /*Status Register*/
 __IO uint32_t RFS;                             /*Receive frame status. Can only be written when RM in CANMOD is 1.*/
 __IO uint32_t RID;                             /*Received Identifier. Can only be written when RM in CANMOD is 1*/
 __IO uint32_t RDA;                             /*Received data bytes 1-4. Can only be written when RM in CANMOD is 1.*/
 __IO uint32_t RDB;                             /*Received data bytes 5-8. Can only be written when RM in CANMOD is 1.*/
 __IO uint32_t TFI1;                            /*Transmit frame info (Tx Buffer 1)*/
 __IO uint32_t TID1;                            /*Transmit Identifier (Tx Buffer 1)*/
 __IO uint32_t TDA1;                            /*Transmit data bytes 1-4 (Tx Buffer 1)*/
 __IO uint32_t TDB1;                            /*Transmit data bytes 5-8 (Tx Buffer 1)*/
 __IO uint32_t TFI2;                            /*Transmit frame info (Tx Buffer 2)*/
 __IO uint32_t TID2;                            /*Transmit Identifier (Tx Buffer 2)*/
 __IO uint32_t TDA2;                            /*Transmit data bytes 1-4 (Tx Buffer 2)*/
 __IO uint32_t TDB2;                            /*Transmit data bytes 5-8 (Tx Buffer 2)*/
 __IO uint32_t TFI3;                            /*Transmit frame info (Tx Buffer 3)*/
 __IO uint32_t TID3;                            /*Transmit Identifier (Tx Buffer 3)*/
 __IO uint32_t TDA3;                            /*Transmit data bytes 1-4 (Tx Buffer 3)*/
 __IO uint32_t TDB3;                            /*Transmit data bytes 5-8 (Tx Buffer 3)*/
}CAN2_TYPEDEF;

/***************************************** CAN WAKE AND SLEEP *************************************************************************/

typedef struct
{
 __IO uint32_t CANSLEEPCLR;                    /*Allows clearing the current CAN channel sleep state as well as reading that state.*/
 __IO uint32_t CANWAKEFLAGS;                   /*Allows reading the wake-up state of the CAN channels*/
}CAN_WAKE_AND_SLEEP_TYPEDEF;

/****************************************************** SSP ***************************************************************************/

typedef struct
{
 __IO uint32_t CR0;                           /*Control Register 0. Selects the serial clock rate, bus type, and data size.*/
 __IO uint32_t CR1;                           /*Control Register 1. Selects master/slave and other modes*/
 __IO uint32_t DR;                            /*Data Register. Writes fill the transmit FIFO, and reads empty the receive FIFO*/
 __I uint32_t SR;                             /*Status Register*/
 __IO uint32_t CPSR;                          /*Clock Prescale Register*/
 __IO uint32_t IMSC;                          /*Interrupt Mask Set and Clear Register*/
 __IO uint32_t RIS;                           /*Raw Interrupt Status Register*/
 __IO uint32_t MIS;                           /*Masked Interrupt Status Register*/
 __IO uint32_t ICR;                           /*SSPICR Interrupt Clear Register*/
 __IO uint32_t DMACR;                         /*DMA Control Register*/
}SSP_TYPEDEF;

/************************************************* I2C BUS INTERFACE ******************************************************************/

typedef struct
{
 __IO uint32_t CONSET;                        /*I2C Control Set Register. When a one is written to a bit of this register,the corresponding bit in the I2C control register is set. Writing a zero has
                                                no effect on the corresponding bit in the I2C control register.*/
 __I uint32_t STAT;                           /*I2C Status Register. During I2C operation, this register provides detailed status codes that allow software to determine the next action
                                                needed.*/
 __IO uint32_t DAT;                           /*I2C Data Register. During master or slave transmit mode, data to be transmitted is written to this register. During master or slave receive
                                                mode, data that has been received may be read from this register.*/
 __IO uint32_t ADR0;                          /*I2C Slave Address Register 0. Contains the 7-bit slave address for operation of the I2C interface in slave mode, and is not used in master
                                                mode. The least significant bit determines whether a slave responds to the General Call address.*/
 __IO uint32_t SCLH;                          /*SCH Duty Cycle Register High Half Word. Determines the high time of the I2C clock.*/
 __IO uint32_t SCLL;                          /*SCL Duty Cycle Register Low Half Word. Determines the low time of
                                                the I2C clock. I2nSCLL and I2nSCLH together determine the clock
                                                frequency generated by an I2C master and certain times used in slave
                                                mode.*/
 __O uint32_t CONCLR;                         /*I2C Control Clear Register. When a one is written to a bit of this
                                                register, the corresponding bit in the I2C control register is cleared.
                                                Writing a zero has no effect on the corresponding bit in the I2C control
                                                register*/
 __IO uint32_t MMCTRL;                        /*Monitor mode control register.*/
 __IO uint32_t ADR1;                          /*I2C Slave Address Register 1. Contains the 7-bit slave address for
                                                operation of the I2C interface in slave mode, and is not used in master
                                                mode. The least significant bit determines whether a slave responds to
                                                the General Call address*/
 __IO uint32_t ADR2;                          /*I2C Slave Address Register 2. Contains the 7-bit slave address for
                                                operation of the I2C interface in slave mode, and is not used in master
                                                mode. The least significant bit determines whether a slave responds to
                                                the General Call address.*/
 __IO uint32_t ADR3;                          /*I2C Slave Address Register 3. Contains the 7-bit slave address for
                                                operation of the I2C interface in slave mode, and is not used in master
                                                mode. The least significant bit determines whether a slave responds to
                                                the General Call address.*/
 __I uint32_t DATA_BUFFER;                    /*Data buffer register. The contents of the 8 MSBs of the I2DAT shift
                                                register will be transferred to the I2DATA_BUFFER automatically after
                                                every 9 bits (8 bits of data plus ACK or NACK) has been received on the
                                                bus.*/
 __IO uint32_t MASK0;                         /*I2C Slave address mask register 0. This mask register is associated
                                                with I2ADR0 to determine an address match. The mask register has no
                                                effect when comparing to the General Call address (‘0000000’).*/
 __IO uint32_t MASK1;                         /*I2C Slave address mask register 1. This mask register is associated
                                                with I2ADR0 to determine an address match. The mask register has no
                                                effect when comparing to the General Call address (‘0000000’).*/
 __IO uint32_t MASK2;                         /*I2C Slave address mask register 2. This mask register is associated
                                                with I2ADR0 to determine an address match. The mask register has no
                                                effect when comparing to the General Call address (‘0000000’).*/
 __IO uint32_t MASK3;                         /*I2C Slave address mask register 3. This mask register is associated
                                                with I2ADR0 to determine an address match. The mask register has no
                                                effect when comparing to the General Call address (‘0000000’).*/
}I2C_BUS_INTERFACE_TYPEDEF;

/******************************************************** I2S *************************************************************************/

typedef struct
{
 __IO uint32_t DAO;                            /*Digital Audio Output Register. Contains control bits for the I2S
                                                 transmit channel*/
 __IO uint32_t DAI;                            /*Digital Audio Input Register. Contains control bits for the I2S receive
                                                 channel.*/
 __O uint32_t TXFIFO;                          /*Transmit FIFO. Access register for the 8 ? 32-bit transmitter FIFO*/
 __I uint32_t RXFIFO;                          /*Receive FIFO. Access register for the 8 ? 32-bit receiver FIFO*/
 __I uint32_t STATE;                           /*Status Feedback Register. Contains status information about the
                                                 I2S interface*/
 __IO uint32_t DMA1;                           /*DMA Configuration Register 1. Contains control information for
                                                 DMA request 1.*/
 __IO uint32_t DMA2;                           /*DMA Configuration Register 2. Contains control information for
                                                 DMA request 2.*/
 __IO uint32_t IRQ;                            /*Interrupt Request Control Register. Contains bits that control how
                                                 the I2S interrupt request is generated*/
 __IO uint32_t TXRATE;                         /*Transmit reference clock divider. This register determines the I2S
                                                 TX_REF rate by specifying the value to divide CCLK by in order to
                                                 produce TX_REF*/
 __IO uint32_t RXRATE;                         /*Receive reference clock divider. This register determines the I2S
                                                 RX_REF rate by specifying the value to divide CCLK by in order to
                                                 produce RX_REF.*/
 __IO uint32_t TXBITRATE;                      /*Transmit bit rate divider. This register determines the I2S transmit
                                                 bit rate by specifying the value to divide TX_REF by in order to
                                                 produce the transmit bit clock*/
 __IO uint32_t RXBITRATE;                      /*Receive bit rate divider. This register determines the I2S receive bit
                                                 rate by specifying the value to divide RX_REF by in order to
                                                 produce the receive bit clock.*/
 __IO uint32_t TXMODE;                         /*Transmit mode control*/
 __IO uint32_t RXMODE;                         /*Receive mode control*/
}I2S_TYPEDEF;

/*********************************************** TIMER ********************************************************************************/

typedef struct
{
 __IO uint32_t IR;                             /*Interrupt Register. The IR can be written to clear interrupts. The IR
                                                 can be read to identify which of eight possible interrupt sources are
                                                 pending.*/
 __IO uint32_t TCR;                            /*Timer Control Register. The TCR is used to control the Timer
                                                 Counter functions. The Timer Counter can be disabled or reset
                                                 through the TCR*/
 __IO uint32_t TC;                             /*Timer Counter. The 32 bit TC is incremented every PR+1 cycles of
                                                 PCLK. The TC is controlled through the TCR.*/
 __IO uint32_t PR;                             /*Prescale Register. When the Prescale Counter (PC) is equal to this
                                                 value, the next clock increments the TC and clears the PC.*/
 __IO uint32_t PC;                             /*Prescale Counter. The 32 bit PC is a counter which is incremented
                                                 to the value stored in PR. When the value in PR is reached, the TC
                                                 is incremented and the PC is cleared. The PC is observable and
                                                 controllable through the bus interface*/
 __IO uint32_t MCR;                            /*Match Control Register. The MCR is used to control if an interrupt
                                                 is generated and if the TC is reset when a Match occurs*/
 __IO uint32_t MR0;                            /*Match Register 0. MR0 can be enabled through the MCR to reset
                                                 the TC, stop both the TC and PC, and/or generate an interrupt
                                                 every time MR0 matches the TC.*/
 __IO uint32_t MR1;                            /*Match Register 1. MR1 can be enabled through the MCR to reset
                                                 the TC, stop both the TC and PC, and/or generate an interrupt
                                                 every time MR1 matches the TC.*/
 __IO uint32_t MR2;                            /*Match Register 2. MR0 can be enabled through the MCR to reset
                                                 the TC, stop both the TC and PC, and/or generate an interrupt
                                                 every time MR2 matches the TC.*/
 __IO uint32_t MR3;                            /*Match Register 3. MR3 can be enabled through the MCR to reset
                                                 the TC, stop both the TC and PC, and/or generate an interrupt
                                                 every time MR3 matches the TC.*/
 __IO uint32_t CCR;                            /*Capture Control Register. The CCR controls which edges of the
                                                 capture inputs are used to load the Capture Registers and whether
                                                 or not an interrupt is generated when a capture takes place.*/
 __I uint32_t CR0;                             /*Capture Register 0. CR0 is loaded with the value of TC when there
                                                 is an event on the CAPn.0 input.*/
 __I uint32_t CR1;                             /*Capture Register 1. CR1 is loaded with the value of TC when there
                                                 is an event on the CAPn.0 input.*/
 __IO uint32_t EMR;                            /*External Match Register. The EMR controls the external match
                                                 pins.*/
 __IO uint8_t RESERVED0[0x30];
 __IO uint32_t CTCR;                           /*Count Control Register. The CTCR selects between Timer and
                                                 Counter mode, and in Counter mode selects the signal and
                                                 edge(s) for counting.*/
}TIMER_TYPEDEF;

/******************************************* SYSTEM TICK TIMER **************************************************************************/

typedef struct
{
 __IO uint32_t STCTRL;                        /*System Timer Control and status register*/
 __IO uint32_t STRELOAD;                      /*System Timer Reload value register*/
 __IO uint32_t STCURR;                        /*System Timer Current value register*/
 __IO uint32_t STCALIB;                       /*System Timer Calibration value register*/
}SYSTEM_TICK_TIMER_TYPEDEF;

/********************************************************** PWM ***********************************************************************/

