RajeshreeRinku/LPC400-header-file/lpc4088.h
typedef struct
{
 __IO uint32_t IR;                            /*Interrupt Register. The IR can be written to clear interrupts, or read to
                                                identify which PWM interrupt sources are pending*/
 __IO uint32_t TCR;                           /*Timer Control Register. The TCR is used to control the Timer Counter
                                                functions.*/
 __IO uint32_t TC;                            /*Timer Counter. The 32 bit TC is incremented every PR+1 cycles of
                                                PCLK. The TC is controlled through the TCR.*/
 __IO uint32_t PR;                            /*Prescale Register. Determines how often the PWM counter is
                                                incremented.*/
 __IO uint32_t PC;                            /*Prescale Counter. Prescaler for the main PWM counter*/
 __IO uint32_t MCR;                           /*Match Control Register. The MCR is used to control whether an
                                                interrupt is generated and if the PWM counter is reset when a Match
                                                occurs.*/
 __IO uint32_t MR0;                           /*Match Register 0. Match registers are continuously compared to the
                                                PWM counter in order to control PWM output edges*/
 __IO uint32_t MR1;                           /*Match Register 1. Match registers are continuously compared to the
                                                PWM counter in order to control PWM output edges*/
 __IO uint32_t MR2;                           /*Match Register 2. Match registers are continuously compared to the
                                                PWM counter in order to control PWM output edges*/
 __IO uint32_t MR3;                           /*Match Register 3. Match registers are continuously compared to the
                                                PWM counter in order to control PWM output edges*/
 __IO uint32_t CCR;                           /*Capture Control Register. The CCR controls which edges of the
                                                capture inputs are used to load the Capture Registers and whether or
                                                not an interrupt is generated for a capture event.*/
 __I uint32_t CR0;                            /*Capture Register 0. CR0 of PWMn is loaded with the value of the TC
                                                when there is an event on the PWMn_CAP0 input*/
 __I uint32_t CR1;                            /*Capture Register 1. CR1 of PWMn is loaded with the value of the TC
                                                when there is an event on the PWMn_CAP0 input*/
 __IO uint8_t RESERVED0[0xC];
 __IO uint32_t MR4;                           /*Match Register 4. Match registers are continuously compared to the
                                                PWM counter in order to control PWM output edges*/
 __IO uint32_t MR5;                           /*Match Register 5. Match registers are continuously compared to the
                                                PWM counter in order to control PWM output edges*/
 __IO uint32_t MR6;                           /*Match Register 6. Match registers are continuously compared to the
                                                PWM counter in order to control PWM output edges*/
 __IO uint32_t PCR;                           /*PWM Control Register. Enables PWM outputs and selects either
                                                single edge or double edge controlled PWM outputs.*/
 __IO uint32_t LER;                           /*Load Enable Register. Enables use of updated PWM match values*/
 __IO uint8_t RESERVED1[0x1C];
 __IO uint32_t CTCR;                          /*Count Control Register. The CTCR selects between Timer and
                                                Counter mode, and in Counter mode selects the signal and edge(s)
                                                for counting.*/ 
}PWM_TYPEDEF;

/********************************************* MOTOR CONTROL PULSE WIDTH MODULATOR ****************************************************/

typedef struct
{
 __I uint32_t CON;                             /*PWM Control read address*/
 __O uint32_t CON_SET;                         /*PWM Control set address*/
 __O uint32_t CON_CLR;                         /*PWM Control clear address*/
 __I uint32_t CAPCON;                          /*Capture Control read address*/
 __O uint32_t CAPCON_SET;                      /*Capture Control set address*/
 __O uint32_t CAPCON_CLR;                      /*Event Control clear address*/
 __IO uint32_t TC0;                            /*Timer Counter register, channel 0*/
 __IO uint32_t TC1;                            /*Timer Counter register, channel 1*/
 __IO uint32_t TC2;                            /*Timer Counter register, channel 2*/
 __IO uint32_t LIM0;                           /*Limit register, channel 0*/
 __IO uint32_t LIM1;                           /*Limit register, channel 1*/
 __IO uint32_t LIM2;                           /*Limit register, channel 2*/
 __IO uint32_t MAT0;                           /*Match register, channel 0*/
 __IO uint32_t MAT1;                           /*Match register, channel 1*/
 __IO uint32_t MAT2;                           /*Match register, channel 2*/
 __IO uint32_t DT;                             /*Dead time register*/
 __IO uint32_t MCCP;                           /*Communication Pattern register*/
 __I uint32_t CAP0;                            /*Capture register, channel 0*/
 __I uint32_t CAP1;                            /*Capture register, channel 1*/
 __I uint32_t CAP2;                            /*Capture register, channel 2*/
 __I uint32_t INTEN;                           /*Interrupt Enable read address*/
 __O uint32_t INTEN_SET;                       /*Interrupt Enable set address*/
 __O uint32_t INTEN_CLR;                       /*Interrupt Enable clear address*/
 __I uint32_t CNTCON;                          /*Count Control read address*/
 __O uint32_t CNTCON_SET;                      /*Count Control set address*/
 __O uint32_t CNTCON_CLR;                      /*Count Control clear address*/
 __I uint32_t INTF;                            /*Interrupt flags read address*/
 __O uint32_t INTF_SET;                        /*Interrupt flags set address*/
 __O uint32_t INTF_CLR;                        /*Interrupt flags clear address*/
 __O uint32_t CAP_CLR;                         /*Capture clear address*/
}MOTOR_CONTROL_PULSE_WIDTH_MODULATOR_TYPEDEF;

