RajeshreeRinku/LPC400-header-file/lpc4088.h
/************************************** Quadrature Encoder Interface (QEI) ************************************************************/

typedef struct
{
 __O uint32_t CON;                             /*Control register*/
 __I uint32_t STAT;                            /*Status register*/
 __IO uint32_t CONF;                           /*Configuration register*/
 __I uint32_t POS;                             /*Position register*/
 __IO uint32_t MAXPOS;                         /*Maximum position register*/
 __IO uint32_t CMPOS0;                         /*Position compare register 0*/
 __IO uint32_t CMPOS1;                         /*Position compare register 1*/
 __IO uint32_t CMPOS2;                         /*Position compare register 2*/
 __I uint32_t INXCNT;                          /*Index count register 0*/
 __IO uint32_t INXCMP0;                        /*Index compare register 0*/
 __IO uint32_t LOAD;                           /*Velocity timer reload register*/
 __I uint32_t TIME;                            /*Velocity timer register*/
 __I uint32_t VEL;                             /*Velocity counter register*/
 __I uint32_t CAP;                             /*Velocity capture register*/
 __IO uint32_t VELCOMP;                        /*Velocity compare register*/
 __IO uint32_t FILTERPHA;                      /*Digital filter register on PHA*/
 __IO uint32_t FILTERPHB;                      /*Digital filter register on PHB*/
 __IO uint32_t FILTERINX;                      /*Digital filter register on IDX*/
 __IO uint32_t WINDOW;                         /*Index acceptance window register*/
 __IO uint32_t INXCMP1;                        /*Index compare register 1*/
 __IO uint32_t INXCMP2;                        /*Index compare register 2*/
 __IO uint8_t RESERVED0[0xF84];
 __O uint32_t IEC;                             /*Interrupt enable clear register*/
 __O uint32_t IES;                             /*Interrupt enable set register*/
 __I uint32_t INTSTAT;                         /*Interrupt status register*/
 __I uint32_t IE;                              /*Interrupt enable register*/
 __O uint32_t CLR;                             /*Interrupt status clear register*/
 __O uint32_t SET;                             /*Interrupt status set register*/
}QEI_TYPEDEF;

/************************************************ REAL TIME CLOCK *********************************************************************/

typedef struct
{
 __IO uint32_t ILR;                            /*Interrupt Location Register*/
 __IO uint32_t RESERVED0;
 __IO uint32_t CCR;                            /*Clock Control Register*/
 __IO uint32_t CIIR;                           /*Counter Increment Interrupt Register*/
 __IO uint32_t AMR;                            /*Alarm Mask Register*/
 __I uint32_t CTIME0;                          /*Consolidated Time Register 0*/
 __I uint32_t CTIME1;                          /*Consolidated Time Register 1*/
 __I uint32_t CTIME2;                          /*Consolidated Time Register 2*/
 __IO uint32_t SEC;                            /*Seconds Counter*/
 __IO uint32_t MIN;                            /*Minutes Register*/
 __IO uint32_t HRS;                            /*Hours Register*/
 __IO uint32_t DOM;                            /*Day of Month Register*/
 __IO uint32_t DOW;                            /*Day of Week Register*/
 __IO uint32_t DOY;                            /*Day of Year Register*/
 __IO uint32_t MONTH;                          /*Months Register*/
 __IO uint32_t YEAR;                           /*Years Register*/
 __IO uint32_t CALIBRATION;                    /*Calibration Value Register*/
 __IO uint32_t GPREG0;                         /*General Purpose Register 0*/
 __IO uint32_t GPREG1;                         /*General Purpose Register 1*/
 __IO uint32_t GPREG2;                         /*General Purpose Register 2*/
 __IO uint32_t GPREG3;                         /*General Purpose Register 3*/
 __IO uint32_t GPREG4;                         /*General Purpose Register 4*/
 __IO uint32_t RTC_AUXEN;                      /*RTC Auxiliary Enable register*/
 __IO uint32_t RTC_AUX;                        /*RTC Auxiliary control register*/
 __IO uint32_t ASEC;                           /*Alarm value for Seconds*/
 __IO uint32_t AMIN;                           /*Alarm value for Minutes*/
 __IO uint32_t AHRS;                           /*Alarm value for Hours*/
 __IO uint32_t ADOM;                           /*Alarm value for Day of Month*/
 __IO uint32_t ADOW;                           /*Alarm value for Day of Week*/
 __IO uint32_t ADOY;                           /*Alarm value for Day of Year*/
 __IO uint32_t AMON;                           /*Alarm value for Months*/
 __IO uint32_t AYRS;                           /*Alarm value for Year*/
}REAL_TIME_CLOCK_TYPEDEF;

/********************************************* EVENT MONITOR/RECORDER *****************************************************************/

typedef struct
{
 __IO uint32_t ERSTATUS;                        /*Event Monitor/Recorder Status register. Contains status flags for
                                                  event channels and other Event Monitor/Recorder conditions.*/
 __IO uint32_t ERCONTROL;                       /*Event Monitor/Recorder Control register. Contains bits that
                                                  control actions for the event channels as well as for Event
                                                  Monitor/Recorder setup.*/
 __I uint32_t ERCOUNTERS;                       /*Event Monitor/Recorder Counters register. Allows reading the
                                                  counters associated with the event channels*/
 __IO uint32_t RESERVED0;
 __I uint32_t ERFIRSTSTAMP0;                    /*Event Monitor/Recorder First Stamp register for channel 0.
                                                  Retains the time stamp for the first event on channel 0.*/
 __I uint32_t ERFIRSTSTAMP1;                    /*Event Monitor/Recorder First Stamp register for channel 1.
                                                  Retains the time stamp for the first event on channel 1.*/
 __I uint32_t ERFIRSTSTAMP2;                    /*Event Monitor/Recorder First Stamp register for channel 2.
                                                  Retains the time stamp for the first event on channel 2.*/
 __IO uint32_t RESERVED1;
 __I uint32_t ERLASTSTAMP0;                     /*Event Monitor/Recorder Last Stamp register for channel 0.
                                                  Retains the time stamp for the last (i.e. most recent) event on
                                                  channel 0*/
 __I uint32_t ERLASTSTAMP1;                     /*Event Monitor/Recorder Last Stamp register for channel 1.
                                                  Retains the time stamp for the last (i.e. most recent) event on
                                                  channel 1*/
 __I uint32_t ERLASTSTAMP2;                     /*Event Monitor/Recorder Last Stamp register for channel 2.
                                                  Retains the time stamp for the last (i.e. most recent) event on
                                                  channel 2*/																									
}EVENT_MONITOR_OR_RECORDER_TYPEDEF;

/*************************************************** WATCHDOG *************************************************************************/

typedef struct
{
 __IO uint32_t MOD;                             /*Watchdog mode register. This register determines the basic
                                                  mode and status of the Watchdog Timer.*/
 __IO uint32_t TC;                              /*Watchdog timer constant register. The value in this register
                                                  determines the time-out value.*/
 __O uint32_t FEED;                             /*Watchdog feed sequence register. Writing 0xAA followed by
                                                  0x55 to this register reloads the Watchdog timer with the
                                                  value contained in WDTC.*/
 __I uint32_t TV;                               /*Watchdog timer value register. This register reads out the
                                                  current value of the Watchdog timer.*/
 __IO uint32_t RESERVED0;
 __IO uint32_t WARNINT;                         /*Watchdog Warning Interrupt compare value*/ 
 __IO uint32_t WINDOW;                          /*Watchdog Window compare value.*/
}WATCHDOG_TYPEDEF;

