RajeshreeRinku/LPC400-header-file/lpc4088.h
/********************************************************** ADC ***********************************************************************/

typedef struct
{
 __IO uint32_t CR;                              /*A/D Control Register. The ADCR register must be written to select
                                                  the operating mode before A/D conversion can occur*/
 __IO uint32_t GDR;                             /*A/D Global Data Register. This register contains the ADC’s DONE
                                                  bit and the result of the most recent A/D conversion.*/
 __IO uint32_t RESERVED0;
 __IO uint32_t INTEN;                           /*A/D Interrupt Enable Register. This register contains enable bits
                                                  that allow the DONE flag of each A/D channel to be included or
                                                  excluded from contributing to the generation of an A/D interrupt.*/
 __I uint32_t DR0;                              /*A/D Channel 0 Data Register. This register contains the result of
                                                  the most recent conversion completed on channel 0.*/
 __I uint32_t DR1;                              /*A/D Channel 0 Data Register. This register contains the result of
                                                  the most recent conversion completed on channel 1.*/
 __I uint32_t DR2;                              /*A/D Channel 0 Data Register. This register contains the result of
                                                  the most recent conversion completed on channel 2.*/
 __I uint32_t DR3;                              /*A/D Channel 0 Data Register. This register contains the result of
                                                  the most recent conversion completed on channel 3.*/
 __I uint32_t DR4;                              /*A/D Channel 0 Data Register. This register contains the result of
                                                  the most recent conversion completed on channel 4.*/
 __I uint32_t DR5;                              /*A/D Channel 0 Data Register. This register contains the result of
                                                  the most recent conversion completed on channel 5.*/
 __I uint32_t DR6;                              /*A/D Channel 0 Data Register. This register contains the result of
                                                  the most recent conversion completed on channel 6.*/
 __I uint32_t DR7;                              /*A/D Channel 0 Data Register. This register contains the result of
                                                  the most recent conversion completed on channel 7.*/
 __I uint32_t STAT;                             /*A/D Status Register. This register contains DONE and OVERRUN
                                                  flags for all of the A/D channels, as well as the A/D interrupt/DMA
                                                  flag.*/
 __IO uint32_t TRM;                             /*ADC trim register*/
}ADC_TYPEDEF;

/**************************************************** DAC *****************************************************************************/

typedef struct
{
 __IO uint32_t CR;                              /*D/A Converter Register. This register contains the digital value
                                                  to be converted to analog and a power control bit.*/
 __IO uint32_t CTRL;                            /*DAC Control register. This register controls DMA and timer
                                                  operation*/
 __IO uint32_t CNTVAL;                          /*DAC Counter Value register. This register contains the reload
                                                  value for the DAC DMA/Interrupt timer.*/
}DAC_TYPEDEF;

/************************************************* COMPARATOR *************************************************************************/

typedef struct 
{
 __IO uint32_t CMP_CTRL;                        /*Comparator block control register*/
 __IO uint32_t CMP_CTRL0;                       /*Comparator 0 control register*/
 __IO uint32_t CMP_CTRL1;                       /*Comparator 1 control register*/
}COMPARATOR_TYPEDEF;

/********************************************************* GPDMA **********************************************************************/

typedef struct
{
 __I uint32_t INTSTAT;                         /* DMA Interrupt Status Register*/
 __I uint32_t INTTCSTAT;                       /* DMA Interrupt Terminal Count Request Status Register*/
 __O uint32_t INTTCCLEAR;                      /*DMA Interrupt Terminal Count Request Clear Register*/
 __I uint32_t INTERRSTAT;                      /* DMA Interrupt Error Status Register*/
 __O uint32_t INTERRCLR;                       /* DMA Interrupt Error Clear Register*/
 __I uint32_t RAWINTTCSTAT;                    /* DMA Raw Interrupt Terminal Count Status Register*/
 __I uint32_t RAWINTERRSTAT;                   /* DMA Raw Error Interrupt Status Register*/
 __I uint32_t ENBLDCHNS;                       /* DMA Enabled Channel Register*/
 __IO uint32_t SOFTBREQ;                       /*DMA Software Burst Request Register*/
 __IO uint32_t SOFTSREQ;                       /* DMA Software Single Request Register*/
 __IO uint32_t SOFTLBREQ;                      /* DMA Software Last Burst Request Register*/
 __IO uint32_t SOFTLSREQ;                      /*DMA Software Last Single Request Register*/ 
 __IO uint32_t CONFIG;                         /* DMA Configuration Register*/
 __IO uint32_t SYNC;                           /*DMA Synchronization Register*/
 __IO uint8_t RESERVED0[0xC8];             
 __IO	uint32_t SRCADDR0;                       /*DMA Channel 0 Source Address Register*/
 __IO uint32_t DESTADDR0;                      /*DMA Channel 0 Destination Address Register*/
 __IO uint32_t LLI0;                           /*DMA Channel 0 Linked List Item Register*/
 __IO uint32_t CONTROL0;                       /*DMA Channel 0 Control Register*/
 __IO uint32_t CONFIG0;                        /*DMA Channel 0 Configuration Register*/
 __IO uint8_t RESERVED1[0xC];
 __IO	uint32_t SRCADDR1;                       /*DMA Channel 1 Source Address Register*/
 __IO uint32_t DESTADDR1;                      /*DMA Channel 1 Destination Address Register*/
 __IO uint32_t LLI1;                           /*DMA Channel 1 Linked List Item Register*/
 __IO uint32_t CONTROL1;                       /*DMA Channel 1 Control Register*/
 __IO uint32_t CONFIG1;                        /*DMA Channel 1 Configuration Register*/
 __IO uint8_t RESERVED2[0xC];
 __IO	uint32_t SRCADDR2;                       /*DMA Channel 2 Source Address Register*/
 __IO uint32_t DESTADDR2;                      /*DMA Channel 2 Destination Address Register*/
 __IO uint32_t LLI2;                           /*DMA Channel 2 Linked List Item Register*/
 __IO uint32_t CONTROL2;                       /*DMA Channel 2 Control Register*/
 __IO uint32_t CONFIG2;                        /*DMA Channel 2 Configuration Register*/
 __IO uint8_t RESERVED3[0xC];
 __IO	uint32_t SRCADDR3;                       /*DMA Channel 3 Source Address Register*/
 __IO uint32_t DESTADDR3;                      /*DMA Channel 3 Destination Address Register*/
 __IO uint32_t LLI3;                           /*DMA Channel 3 Linked List Item Register*/
 __IO uint32_t CONTROL3;                       /*DMA Channel 3 Control Register*/
 __IO uint32_t CONFIG3;                        /*DMA Channel 3 Configuration Register*/
 __IO uint8_t RESERVED4[0xC];
 __IO	uint32_t SRCADDR4;                       /*DMA Channel 4 Source Address Register*/
 __IO uint32_t DESTADDR4;                      /*DMA Channel 4 Destination Address Register*/
 __IO uint32_t LLI4;                           /*DMA Channel 4 Linked List Item Register*/
 __IO uint32_t CONTROL4;                       /*DMA Channel 4 Control Register*/
 __IO uint32_t CONFIG4;                        /*DMA Channel 4 Configuration Register*/
 __IO uint8_t RESERVED5[0xC];
 __IO	uint32_t SRCADDR5;                       /*DMA Channel 5 Source Address Register*/
 __IO uint32_t DESTADDR5;                      /*DMA Channel 5 Destination Address Register*/
 __IO uint32_t LLI5;                           /*DMA Channel 5 Linked List Item Register*/
 __IO uint32_t CONTROL5;                       /*DMA Channel 5 Control Register*/
 __IO uint32_t CONFIG5;                        /*DMA Channel 5 Configuration Register*/
 __IO uint8_t RESERVED6[0xC];
 __IO	uint32_t SRCADDR6;                       /*DMA Channel 6 Source Address Register*/
 __IO uint32_t DESTADDR6;                      /*DMA Channel 6 Destination Address Register*/
 __IO uint32_t LLI6;                           /*DMA Channel 6 Linked List Item Register*/
 __IO uint32_t CONTROL6;                       /*DMA Channel 6 Control Register*/
 __IO uint32_t CONFIG6;                        /*DMA Channel 6 Configuration Register*/
 __IO uint8_t RESERVED7[0xC];
 __IO	uint32_t SRCADDR7;                       /*DMA Channel 7 Source Address Register*/
 __IO uint32_t DESTADDR7;                      /*DMA Channel 7 Destination Address Register*/
 __IO uint32_t LLI7;                           /*DMA Channel 7 Linked List Item Register*/
 __IO uint32_t CONTROL7;                       /*DMA Channel 7 Control Register*/
 __IO uint32_t CONFIG7;                        /*DMA Channel 7 Configuration Register*/
}GPDMA_TYPEDEF;

/************************************************* CRC ENGINE *************************************************************************/

typedef struct
{
 __IO uint32_t MODE;                          /*CRC mode register*/
 __IO uint32_t SEED;                          /* CRC seed register*/
	union{
 __I uint32_t SUM;                            /*CRC checksum register*/
 __O uint32_t DATA;                           /*CRC data register*/
	}CRC_UNION;
}CRC_ENGINE_TYPEDEF;

/******************************************* EEPROM CONTROLLER ************************************************************************/

typedef struct
{
 __IO uint32_t CMD;                          /* EEPROM command register*/
 __IO uint32_t ADDR;                         /*EEPROM address register*/
 __O uint32_t WDATA;                         /*EEPROM write data register*/
 __I uint32_t RDATA;                         /*EEPROM read data register*/
 __IO uint32_t WSTATE;                       /*EEPROM wait state register*/
 __IO uint32_t CLKDIV;                       /*EEPROM clock divider register*/
 __IO uint32_t PWRDWN;                       /*EEPROM power-down register*/
 __IO uint8_t RESERVED[0xF3C];
 __O uint32_t INTENCLR;                      /*EEPROM interrupt enable clear*/
 __O uint32_t INTENSET;                      /*EEPROM interrupt enable set*/
 __I uint32_t INTSTAT;                       /*EEPROM interrupt status*/
 __I uint32_t INTEN;                         /*EEPROM interrupt enable*/
 __I uint32_t INTSTATCLR;                    /*EEPROM interrupt status clear*/
 __I uint32_t INTSTATSET;                    /*EEPROM interrupt status set*/
}EEPROM_CONTROLER_TYPEDEF;

