RajeshreeRinku/LPC400-header-file/lpc4088.h
/****************************************** FLASH CONTROLLER **************************************************************************/

typedef struct
{
 __IO uint32_t FMSSTART;                     /*Signature start address register*/
 __IO uint32_t FMSSTOP;                      /*Signature stop-address register*/
 __I uint32_t FMSW0;                         /* 128-bit signature Word 0*/
 __I uint32_t FMSW1;                         /*128-bit signature Word 1 */
 __I uint32_t FMSW2;                         /*128-bit signature Word 2*/
 __I uint32_t FMSW3;                         /*128-bit signature Word 3*/
 __IO uint8_t RESERVED0[0xFA4];
 __I uint32_t STAT;                          /*Signature generation status register*/
 __IO uint32_t RESERVED1;
 __O uint32_t STATCLR;                       /*Signature generation status clear register*/
}FLASH_CONTROLLER_TYPEDEF;

/************************************************************ BASE ADDRESS *************************************************************/

#define SYSTEM_CONTROL                                       (SYSTEM_CONTROL_TYPEDEF*)0x400FC080
#define FLASH_CONTROL                                        (FLASH_CONTROL_TYPEDEF*)0x400FC000
#define INTERRUPT_SET_ENABLE                                 (INTERRUPT_SET_ENABLE_TYPEDEF*)0xE000E100
#define INTERRUPT_CLEAR_ENABLE                               (INTERRUPT_CLEAR_ENABLE_TYPEDEF*)0xE000E180
#define INTERRUPT_SET_PENDING                                (INTERRUPT_SET_PENDING_TYPEDEF*)0xE000E200
#define INTERRUPT_CLEAR_PENDING                              (INTERRUPT_CLEAR_PENDING_TYPEDEF*)0xE000E280
#define INTERRUPT_ACTIVE_BIT                                 (INTERRUPT_ACTIVE_BIT_TYPEDEF*)0xE000E300
#define INTERRUPT_POLARITY                                   (INTERRUPT_POLARITY_TYPEDEF*)0xE000E400
#define SOFTWARE_TRIGGER_INTERRUPT                           (SOFTWARE_TRIGGER_INTERRUPT_TYPEDEF*)0xE000EF00
#define IOCON                                                (IOCON_TYPEDEF*)0x4002C000
#define GPIO                                                 (GPIO_TYPEDEF*)0x20098000
#define GPIO_INTERRUPT                                       (GPIO_INTERRUPT_TYPEDEF*)0x40028080
#define EMC                                                  (EMC_TYPEDEF*)0x2009C000
#define ETHERNET                                             (ETHERNET_TYPEDEF*)0x20084000
#define LCD_CONTROLLER                                       (LCD_CONTROLLER_TYPEDEF*)0x20088000
#define USB_DEVICE_CONTROLLER                                (USB_DEVICE_CONTROLLER_TYPEDEF*)0x2008C110
#define USB_HOST_CONTROLLER                                  (USB_HOST_CONTROLLER_TYPEDEF*)0x2008C000
#define USB_OTG_CONTROLLER                                   (USB_OTG_CONTROLLER_TYPEDEF*)0x2008C100
#define SD_CARD_INTERFACE                                    (SD_CARD_INTERFACE_TYPEDEF*)0x0x400C0000
#define UART1                                                (UART1_TYPEDEF*)0x40010000
#define UART0                                                (UART0_TYPEDEF*)0x4000C000
#define UART2                                                (UART2_TYPEDEF*)0x40088000
#define UART3                                                (UART3_TYPEDEF*)0x4009C000
#define UART4                                                (UART4_TYPEDEF*)0x400A4000
#define CAN_ACCEPTANCE_FILTER                                (CAN_ACCEPTANCE_FILTER_TYPEDEF*)0x4003C000
#define CENTRAL_CAN                                          (CENTRAL_CAN_TYPEDEF*)0x40040000
#define CAN1                                                 (CAN1_TYPEDEF*)0x40044000
#define CAN2                                                 (CAN2_TYPEDEF*)0x40048000
#define CAN_WAKE_AND_SLEEP                                   (CAN_WAKE_AND_SLEEP_TYPEDEF*)0x400FC000
#define SSP0                                                 (SSP_TYPEDEF*)0x40088000
#define SSP1                                                 (SSP_TYPEDEF*)0x40030000
#define SSP2                                                 (SSP_TYPEDEF*)0x400AC000
#define I2C0                                                 (I2C_BUS_INTERFACE_TYPEDEF*)0x4001C000
#define I2C1                                                 (I2C_BUS_INTERFACE_TYPEDEF*)0x4005C000
#define I2C2                                                 (I2C_BUS_INTERFACE_TYPEDEF*)0x400A0000
#define I2S                                                  (I2S_TYPEDEF*)0x400A8000
#define TIMER0                                               (TIMER_TYPEDEF*)0x40004000
#define TIMER1                                               (TIMER_TYPEDEF*)0x40008000
#define TIMER2                                               (TIMER_TYPEDEF*)0x40090000
#define TIMER3                                               (TIMER_TYPEDEF*)0x40094000
#define SYSTEM_TICK_TIMER                                    (SYSTEM_TICK_TIMER_TYPEDEF*)0xE000E010
#define PWM0                                                 (PWM_TYPEDEF)0x40014000
#define PWM1                                                 (PWM_TYPEDEF)0x40018000
#define MOTOR_CONTROL_PULSE_WIDTH_MODULATOR                  (MOTOR_CONTROL_PULSE_WIDTH_MODULATOR_TYPEDEF*)0x400B8000)
#define QEI                                                  (QEI_TYPEDEF*)0x400BC000
#define REAL_TIME_CLOCK                                      (REAL_TIME_CLOCK_TYPEDEF*)0x40024000
#define EVENT_MONITOR_OR_RECORDER                            (EVENT_MONITOR_OR_RECORDER_TYPEDEF*)0x40024000
#define WATCHDOG                                             (WATCHDOG_TYPEDEF*)0x40000000
#define ADC                                                  (ADC_TYPEDEF*)0x40034000
#define DAC                                                  (DAC_TYPEDEF*)0x4008C000
#define COMPARATOR                                           (COMPARATOR_TYPEDEF*)0x40020000
#define GPDMA                                                (GPDMA_TYPEDEF*)0x20080000                   
#define CRC_ENGINE                                           (CRC_ENGINE_TYPEDEF*)0x20090000
#define EEPROM_CONTROLLER                                    (EEPROM_CONTROLLER_TYPEDEF*)0x00200080
#define FLASH_CONTROLLER                                     (FLASH_CONTROLLER_TYPEDEF*)0x00200020